      ***********************************************************       00010001
      *    CRUD DE ESTUDIANTES (ADICION,MODIFICACION,CONSULTA Y *       00020001
      *    RETIRO COMO PARAMETRO DE ENTRADA RECIBE EL USUARIO   *       00030001
      *    Y SUS PERMISOS                                       *       00040001
      *-----------------------------------------------------------*     00050001
      * MODIFICACIONES:                                                 00060001
      *  OCT 9, 2024: ULTIMA VERSION TAREA                              00070001
      *               CONSULTA LOS PERMISOS Y EL PERFIL DEL USUARIO     00080001
      *-----------------------------------------------------------*     00090001
       IDENTIFICATION DIVISION.                                         00100001
      *------------------------*                                        00110001
       PROGRAM-ID. PSNEST05.                                            00120001
      *                                                                 00130001
       ENVIRONMENT DIVISION.                                            00140001
       DATA DIVISION.                                                   00150001
       WORKING-STORAGE SECTION.                                         00160001
       COPY CSNES05.                                                    00170001
       COPY CSNOP03.                                                    00180001
       COPY CSNOP04.                                                    00190001
       COPY CSNOP05.                                                    00200001
       COPY CSNOP06.                                                    00210001
       COPY CSNOP07.                                                    00220001
       COPY CSNOP08.                                                    00230001
      *COMMAREA                                                         00240001
       01 MI-COMMAREA.                                                  00250001
          03 TRANS             PIC X(04).                               00260001
          03 TERM              PIC X(04).                               00270001
          03 CICLO             PIC X(02).                               00280001
          03 TIPOUSUA          PIC X(05).                               00290001
          03 USU               PIC X(09).                               00300001
          03 NOMUSU            PIC X(20).                               00310001
          03 APEUSU            PIC X(20).                               00320001
          03 PAS               PIC X(08).                               00330001
          03 PERFIL            PIC X(16).                               00340001
          03 CED               PIC X(09).                               00350001
          03 CLAVE             PIC X(8).                                00360001
          03 NOM               PIC X(20).                               00370001
          03 APE               PIC X(20).                               00380001
          03 DIR               PIC X(35).                               00390001
          03 CARGO             PIC X(20).                               00400001
          03 ESTADO            PIC X.                                   00410001
          03 TIPO              PIC X(06).                               00420001
          03 SUB-TIPO          PIC XX.                                  00430001
          03 EXISTE            PIC X.                                   00440001
          03 NUM-REGISTRO      PIC 9(5).                                00450001
          03 CONTADOR-REGISTRO PIC S9(5).                               00460001
          03 CODIGO-CURSOR     PIC XX.                                  00470001
          03 MLIKE             PIC X(35).                               00480001
       01 CA-COMMAREA.                                                  00490001
           03 CA-TRANS                    PIC X(04).                    00500001
           03 CA-TERM                     PIC X(04).                    00510001
           03 CA-CICLO                    PIC X(02).                    00520001
           03 CA-US-DNI                   PIC X(09).                    00530001
           03 CA-US-TIPOUSUA              PIC X(05).                    00540001
           03 CA-US-NOMBRE                PIC X(20).                    00550001
           03 CA-US-APELLIDOS             PIC X(20).                    00560001
           03 CA-PF-IDPERFIL              PIC X(3).                     00570001
           03 CA-PF-NOMPERFIL             PIC X(20).                    00580001
           03 CA-PF-CONS                  PIC X(2).                     00590001
           03 CA-PF-BORR                  PIC X(2).                     00600001
           03 CA-PF-INGR                  PIC X(2).                     00610001
           03 CA-PF-MODI                  PIC X(2).                     00620001
      *    03 CA-FILLER                   PIC X(162).                   00630001
      *                                                                 00640001
      *COMMAREA                                                         00650001
       01 RC-COMMAREA.                                                  00660001
          03 RTRANS             PIC X(04).                              00670001
          03 RTERM              PIC X(04).                              00680001
          03 RCICLO             PIC X(02).                              00690001
          03 RTIPOUSUA          PIC X(05).                              00700001
          03 RUSU               PIC X(09).                              00710001
          03 RNOMUSU            PIC X(20).                              00720001
          03 RAPEUSU            PIC X(20).                              00730001
          03 RPAS               PIC X(08).                              00740001
          03 RPERFIL            PIC X(16).                              00750001
          03 RCED               PIC X(09).                              00760001
          03 RCLAVE             PIC X(8).                               00770001
          03 RNOM               PIC X(20).                              00780001
          03 RAPE               PIC X(20).                              00790001
          03 RDIR               PIC X(35).                              00800001
          03 RCARGO             PIC X(20).                              00810001
          03 RESTADO            PIC X.                                  00820001
          03 RTIPO              PIC X(06).                              00830001
          03 RSUB-TIPO          PIC XX.                                 00840001
          03 REXISTE            PIC X.                                  00850001
          03 RNUM-REGISTRO      PIC 9(5).                               00860001
          03 RCONTADOR-REGISTRO PIC S9(5).                              00870001
          03 RCODIGO-CURSOR     PIC XX.                                 00880001
          03 RMLIKE             PIC X(35).                              00890001
       01  AREA-LINK.                                                   00900001
           05 LK-PM-TIPO-OPE        PIC 9(01).                          00910001
           05 LK-PM-SUBTIPO-OPE     PIC 9(02).                          00920001
           05 LK-PM-TRAN            PIC X(04).                          00930001
           05 LK-PM-DNI             PIC X(09).                          00940001
           05 LK-PM-IDPERFIL        PIC X(03).                          00950001
           05 LK-PM-NROACCESOS      PIC S9(9) USAGE COMP.               00960001
           05 LK-PM-FECHAUL         PIC X(10).                          00970001
           05 LK-PM-HORAUL          PIC X(08).                          00980001
           05 LK-PM-COD-RET         PIC 9(02).                          00990001
           05 LK-PM-SQLCODE         PIC S9(9).                          01000001
           05 LK-PM-ESPACIOS        PIC X(75).                          01010001
       01  AREA-LINK-RPF.                                               01020001
           05 LK-PF-TIPO-OPE        PIC 9(01).                          01030001
           05 LK-PF-SUBTIPO-OPE     PIC 9(02).                          01040001
           05 LK-PF-TRAN            PIC X(04).                          01050001
           05 LK-PF-IDPERFIL        PIC X(03).                          01060001
           05 LK-PF-NOMBRE          PIC X(20).                          01070001
           05 LK-PF-CONSUL          PIC X(02).                          01080001
           05 LK-PF-BORRAR          PIC X(02).                          01090001
           05 LK-PF-INGRESAR        PIC X(02).                          01100001
           05 LK-PF-MODIF           PIC X(02).                          01110001
           05 LK-PF-COD-RET         PIC 9(02).                          01120001
           05 LK-PF-SQLCODE         PIC S9(9).                          01130001
       01  WS-TRANSA                PIC X(04) VALUE  'SN05'.            01140001
       01  WS-RESPUESTA             PIC S9(08) COMP.                    01150001
       01 WS-PERFIL.                                                    01160001
          02 WS-TRAN         PIC X(4).                                  01170001
          02 WS-IDPERFIL     PIC X(3).                                  01180001
          02 WS-CONS         PIC X(2).                                  01190001
          02 WS-BORR         PIC X(2).                                  01200001
          02 WS-INGR         PIC X(2).                                  01210001
          02 WS-MODI         PIC X(2).                                  01220001
          02 WS-FILLER       PIC X.                                     01230001
      *VARIABLES                                                        01240001
       01 MSG-FIN-SESION PIC X(40) VALUE '          FIN SESION'.        01250001
       01  DFHMFSET         PIC X VALUE '8'.                            01260001
      *ESTA COLA LA USO PARA LLEVAR LOS REGISTROS LEIDOS EN TABLA       01270001
      *DE ESTUDIANTES Y DESPUES MOSTRAR POR CONSULTA ESTOS DATOS        01280001
       01 COLA-USUARIOS.                                                01290001
          05 C-DNI       PIC X(09).                                     01300001
          05 C-NOMBRE    PIC X(20).                                     01310001
          05 C-APELLIDOS PIC X(20).                                     01320001
          05 C-DIRECCION PIC X(35).                                     01330001
      *ESTA COLA LA USO COMO UN DEBUG PARA LEER DATOS EN CUALQUIER      01340001
      *PARTE DEL PROGRAMA                                               01350001
       01 COLA-TRABAJO.                                                 01360001
          05 T-AREA-LINK PIC X(257).                                    01370001
          05 T-DNI       PIC X(09).                                     01380001
          05 T-NOMBRE    PIC X(20).                                     01390001
          05 T-APELLIDOS PIC X(20).                                     01400001
          05 T-DIRECCION PIC X(35).                                     01410001
          05 T-CONSUL    PIC XX.                                        01420001
          05 T-BORRAR    PIC XX.                                        01430001
          05 T-INGRESAR  PIC XX.                                        01440001
          05 T-MODIF     PIC XX.                                        01450001
          05 T-SQLCODE   PIC X(10).                                     01460001
      *01 FILLER PIC X(20) VALUE 'TABLA678901234567890'.                01470001
                                                                        01480001
                                                                        01490001
       01 DB2-ERR.                                                      01500001
          03 DB2-SQLCODE              PIC S9(9).                        01510001
          03 DB2-SQLCODE-Z            PIC -ZZZZZZZZ9.                   01520001
          03 DB2-ERROR.                                                 01530001
             05 DB2-ERR-MSG           PIC X(50).                        01540001
             05 DB2-ERR-CODE          PIC X(20).                        01550001
       01 RESPUESTA      PIC S9(08) COMP.                               01560001
       01 SW-CICLO       PIC X(02).                                     01570001
          88 CICLO-0     VALUE '00'.                                    01580001
          88 CICLO-1     VALUE '01'.                                    01590001
          88 CICLO-2     VALUE '02'.                                    01600001
          88 CICLO-3     VALUE '03'.                                    01610001
          88 CICLO-4     VALUE '04'.                                    01620001
          88 CICLO-5     VALUE '05'.                                    01630001
          88 CICLO-6     VALUE '06'.                                    01640001
          88 CICLO-7     VALUE '07'.                                    01650001
          88 CICLO-8     VALUE '08'.                                    01660001
          88 CICLO-9     VALUE '09'.                                    01670001
          88 CICLO-20    VALUE '20'.                                    01680001
          88 CICLO-30    VALUE '30'.                                    01690001
          88 CICLO-31    VALUE '31'.                                    01700001
          88 CICLO-50    VALUE '50'.                                    01710001
          88 CICLO-51    VALUE '51'.                                    01720001
          88 CICLO-52    VALUE '52'.                                    01730001
          88 CICLO-70    VALUE '70'.                                    01740001
          88 CICLO-71    VALUE '71'.                                    01750001
          88 CICLO-88    VALUE '88'.                                    01760001
          88 CICLO-99    VALUE '99'.                                    01770001
      * AYUSASA COLATS                                                  01780001
       01 WC-CONSTANTES.                                                01790001
          03 WC-CUR-CED   PIC 9(3) VALUE 486.                           01800001
          03 WC-CUR-NOM   PIC 9(3) VALUE 506.                           01810001
          03 WC-CUR-APE   PIC 9(3) VALUE 586.                           01820001
          03 WC-CUR-DIR   PIC 9(3) VALUE 666.                           01830001
          03 WC-CUR-POS   PIC 9(3) VALUE ZEROS.                         01840001
       77 WS-TRANS       PIC X(4)  VALUE 'SN05'.                        01850001
       77 WS-COLA-USUARIOS PIC X(08).                                   01860001
       77 WS-TRABAJOCOLA PIC X(08) VALUE 'KTEST05'.                     01870001
       77 WS-NUM-ELMENT  PIC S9(4) COMP VALUE 1.                        01880001
       77 WS-ITEM        PIC X(5) VALUE SPACES.                         01890001
       77 WS-EOF         PIC X VALUE SPACES.                            01900001
       77 WS-OPCION      PIC X VALUE SPACES.                            01910001
       77 WS-EXISTE      PIC 9 VALUE ZEROS.                             01920001
       77 WS-CEDI-PROX   PIC X(9) VALUE SPACES.                         01930001
       77 WS-CEDI-PREV   PIC X(9) VALUE SPACES.                         01940001
       77 WS-CEDI-PROXIMO PIC X(9) VALUE SPACES.                        01950001
       77 WS-OPERACION   PIC 9.                                         01960001
      * AYUDAS DE MBS                                                   01970001
       COPY DFHAID.                                                     01980001
       COPY DFHBMSCA.                                                   01990001
       LINKAGE SECTION.                                                 02000001
       01 DFHCOMMAREA    PIC X(257).                                    02010001
                                                                        02020001
       PROCEDURE DIVISION.                                              02030001
       0000-RAIZ.                                                       02040001
      *EXCEPCIONES DB2                                                  02050001
      *   EXEC CICS INQUIRE TSQUEUE                                     02060001
      *      QUEUE('KCICS54')                                           02070001
      *      RESP(EIBRESP)                                              02080001
      *   END-EXEC.                                                     02090001
      *   IF EIBRESP = 0                                                02100001
      *       EXEC CICS DELETEQ TS                                      02110001
      *         QUEUE (WS-TRABAJOCOLA)                                  02120001
      *         RESP (RESPUESTA)                                        02130001
      *       END-EXEC                                                  02140001
      *   END-IF                                                        02150001
           PERFORM 0100-INICIO                                          02160001
           PERFORM 0200-PROCESO                                         02170001
           PERFORM 0300-FIN                                             02180001
           .                                                            02190001
      **********************************************************        02200001
      *INICIO DEL PROGRAMA, LA COMMAREA TRAE EL CICLO EN QUE   *        02210001
      * ESTAMOS TRABAJANDO Y NOS LLEVA A CONTINUAR EN ESE CICLO*        02220001
      **********************************************************        02230001
       0100-INICIO.                                                     02240001
           MOVE 'KSNU'        TO WS-COLA-USUARIOS(1:4)                  02250001
           MOVE EIBTRMID      TO WS-COLA-USUARIOS(5:4)                  02260001
           EVALUATE TRUE                                                02270001
            WHEN EIBCALEN = 0                                           02280001
              SET CICLO-0 TO TRUE                                       02290001
            WHEN OTHER                                                  02300001
                                                                        02310001
               MOVE DFHCOMMAREA TO  MI-COMMAREA                         02320001
               MOVE PERFIL      TO  WS-PERFIL                           02330001
               EVALUATE CICLO                                           02340001
                 WHEN '00'                                              02350001
                   SET CICLO-0 TO TRUE                                  02360001
                 WHEN '01'                                              02370001
                   SET CICLO-1 TO TRUE                                  02380001
                 WHEN '02'                                              02390001
                   SET CICLO-2 TO TRUE                                  02400001
                 WHEN '03'                                              02410001
                   SET CICLO-3 TO TRUE                                  02420001
                 WHEN '04'                                              02430001
                   SET CICLO-4 TO TRUE                                  02440001
                 WHEN '05'                                              02450001
                   SET CICLO-5 TO TRUE                                  02460001
                 WHEN '06'                                              02470001
                   SET CICLO-6 TO TRUE                                  02480001
                 WHEN '07'                                              02490001
                  SET CICLO-7 TO TRUE                                   02500001
                 WHEN '08'                                              02510001
                   SET CICLO-8 TO TRUE                                  02520001
                 WHEN '09'                                              02530001
                   SET CICLO-9 TO TRUE                                  02540001
                 WHEN '20'                                              02550001
                   SET CICLO-20 TO TRUE                                 02560001
                 WHEN '30'                                              02570001
                   SET CICLO-30 TO TRUE                                 02580001
                 WHEN '31'                                              02590001
                   SET CICLO-31 TO TRUE                                 02600001
                 WHEN '50'                                              02610001
                   SET CICLO-50 TO TRUE                                 02620001
                 WHEN '51'                                              02630001
                   SET CICLO-51 TO TRUE                                 02640001
                 WHEN '52'                                              02650001
                   SET CICLO-52 TO TRUE                                 02660001
                 WHEN '70'                                              02670001
                   SET CICLO-70 TO TRUE                                 02680001
                 WHEN '71'                                              02690001
                   SET CICLO-71 TO TRUE                                 02700001
                 WHEN '88'                                              02710001
                   MOVE DFHCOMMAREA     TO CA-COMMAREA                  02720001
                   MOVE CA-TRANS        TO TRANS                        02730001
                   MOVE CA-TERM         TO TERM                         02740001
                   MOVE CA-CICLO        TO CICLO                        02750001
                   MOVE CA-US-DNI       TO USU                          02760001
                   MOVE CA-US-NOMBRE    TO NOMUSU                       02770001
                   MOVE CA-US-APELLIDOS TO APEUSU                       02780001
                   MOVE CA-TRANS        TO WS-TRAN                      02790001
                   MOVE USU             TO LK-PM-DNI                    02800001
                   PERFORM 0260-LEA-PERMISOS                            02810001
                   PERFORM 0260-LEA-PERFILES                            02820001
                   MOVE LK-PF-IDPERFIL  TO WS-IDPERFIL                  02830001
                   MOVE LK-PF-CONSUL    TO WS-CONS                      02840001
                   MOVE LK-PF-BORRAR    TO WS-BORR                      02850001
                   MOVE LK-PF-INGRESAR  TO WS-INGR                      02860001
                   MOVE LK-PF-MODIF     TO WS-MODI                      02870001
                   MOVE WS-PERFIL       TO PERFIL                       02880001
                   SET CICLO-0 TO TRUE                                  02890001
                 WHEN '99'                                              02900001
                   SET CICLO-0 TO TRUE                                  02910001
                 WHEN OTHER                                             02920001
                   MOVE "                  CICLO NO PROGRAMADO"         02930001
                                             TO MSG-FIN-SESION          02940001
                   PERFORM 0300-FIN                                     02950001
               END-EVALUATE                                             02960001
           END-EVALUATE                                                 02970001
           .                                                            02980001
      ***************************************************               02990001
      *   CICLO-1 DIGITACION DE USUARIO Y CONTRASEÑA    *               03000001
      *   SI ES VALIDA ACTIVA EL CICLO-2                *               03010001
      ***************************************************               03020001
       0200-PROCESO.                                                    03030001
           EVALUATE TRUE                                                03040001
               WHEN CICLO-0                                             03050001
                 PERFORM 0201-CICLO-0                                   03060001
               WHEN CICLO-1                                             03070001
                 PERFORM 0202-CICLO-1                                   03080001
               WHEN CICLO-2                                             03090001
                 PERFORM 0203-CICLO-2                                   03100001
               WHEN CICLO-3                                             03110001
                 PERFORM 0204-CICLO-3                                   03120001
               WHEN CICLO-4                                             03130001
                 PERFORM 0205-CICLO-4                                   03140001
               WHEN CICLO-5                                             03150001
                 PERFORM 0206-CICLO-5                                   03160001
               WHEN CICLO-6                                             03170001
                 PERFORM 0207-CICLO-6                                   03180001
               WHEN CICLO-7                                             03190001
                 PERFORM 0208-CICLO-7                                   03200001
               WHEN CICLO-8                                             03210001
                 PERFORM 0209-CICLO-8                                   03220001
               WHEN CICLO-9                                             03230001
                 PERFORM 0210-CICLO-9                                   03240001
               WHEN CICLO-20                                            03250001
                 PERFORM 0210-CICLO-20                                  03260001
               WHEN CICLO-30                                            03270001
                 PERFORM 0210-CICLO-30                                  03280001
               WHEN CICLO-31                                            03290001
                 PERFORM 0210-CICLO-31                                  03300001
               WHEN CICLO-50                                            03310001
                 PERFORM 0210-CICLO-50                                  03320001
               WHEN CICLO-51                                            03330001
                 PERFORM 0210-CICLO-51                                  03340001
               WHEN CICLO-52                                            03350001
                 PERFORM 0210-CICLO-52                                  03360001
               WHEN CICLO-70                                            03370001
                 PERFORM 0208-CICLO-70                                  03380001
               WHEN CICLO-71                                            03390001
                 PERFORM 0209-CICLO-71                                  03400001
               WHEN CICLO-99                                            03410001
                 SET CICLO-0 TO TRUE                                    03420001
                 PERFORM 0201-CICLO-0                                   03430001
           END-EVALUATE                                                 03440001
             .                                                          03450001
      ********************************************************          03460001
      * FIN DE LA TRANSACCION, LLAMA O RETORNA AL PROGRAMA DE*          03470001
      *                SEGURIDAD                             *          03480001
      ********************************************************          03490001
       0300-FIN.                                                        03500001
           MOVE '99'         TO CICLO                                   03510001
           MOVE TRANS        TO CA-TRANS                                03520001
           MOVE TERM         TO CA-TERM                                 03530001
           MOVE CICLO        TO CA-CICLO                                03540001
           MOVE USU          TO CA-US-DNI                               03550001
           MOVE NOMUSU       TO CA-US-NOMBRE                            03560001
           MOVE APEUSU       TO CA-US-APELLIDOS                         03570001
           MOVE PERFIL       TO WS-PERFIL                               03580001
           MOVE WS-IDPERFIL  TO CA-PF-IDPERFIL                          03590001
           MOVE WS-CONS      TO CA-PF-CONS                              03600001
           MOVE WS-BORR      TO CA-PF-BORR                              03610001
           MOVE WS-INGR      TO CA-PF-INGR                              03620001
           MOVE WS-MODI      TO CA-PF-MODI                              03630001
           EXEC CICS                                                    03640001
                SET TERMINAL(EIBTRMID) UCTRAN                           03650001
           END-EXEC                                                     03660001
           MOVE 'XCTL'     TO TRANS                                     03670001
           EXEC CICS XCTL                                               03680001
                PROGRAM('PSNMEN02')                                     03690001
                COMMAREA(CA-COMMAREA)                                   03700001
                LENGTH(LENGTH OF MI-COMMAREA)                           03710001
                RESP(RESPUESTA)                                         03720001
           END-EXEC                                                     03730001
           EXEC CICS RETURN                                             03740001
           END-EXEC                                                     03750001
           GOBACK                                                       03760001
           .                                                            03770001
      ***************************************************               03780001
      *   CICLO INICIAL MUESTRA EN PANTALLA EL MENU DEL *               03790001
      *   CRUD                                          *               03800001
      ***************************************************               03810001
       0201-CICLO-0.                                                    03820001
           EVALUATE TRUE                                                03830001
             WHEN WS-CONS = 'SI' AND WS-BORR = 'SI' AND                 03840001
                  WS-INGR = 'SI' AND WS-MODI = 'SI'                     03850001
                  MOVE LOW-VALUE          TO MSNOP03O                   03860001
                  MOVE USU                TO LOG03O                     03870001
                  MOVE NOMUSU             TO LNOM03O                    03880001
                  MOVE APEUSU             TO LAPE03O                    03890001
                  PERFORM 0222-SEND-MAPMENU03                           03900001
             WHEN WS-CONS = 'SI' AND WS-BORR = 'NO' AND                 03910001
                  WS-INGR = 'NO' AND WS-MODI = 'SI'                     03920001
                  MOVE LOW-VALUE          TO MSNOP04O                   03930001
                  MOVE USU                TO LOG04O                     03940001
                  MOVE NOMUSU             TO LNOM04O                    03950001
                  MOVE APEUSU             TO LAPE04O                    03960001
                  PERFORM 0222-SEND-MAPMENU04                           03970001
             WHEN WS-CONS = 'SI' AND WS-BORR = 'NO' AND                 03980001
                  WS-INGR = 'NO' AND WS-MODI = 'NO'                     03990001
                 MOVE LOW-VALUE          TO MSNOP05O                    04000001
                 MOVE USU                TO LOG05O                      04010001
                 MOVE NOMUSU             TO LNOM05O                     04020001
                 MOVE APEUSU             TO LAPE05O                     04030001
                 PERFORM 0222-SEND-MAPMENU05                            04040001
             WHEN WS-CONS = 'SI' AND WS-BORR = 'NO' AND                 04050001
                  WS-INGR = 'SI' AND WS-MODI = 'NO'                     04060001
                 MOVE LOW-VALUE          TO MSNOP06O                    04070001
                 MOVE USU                TO LOG06O                      04080001
                 MOVE NOMUSU             TO LNOM06O                     04090001
                 MOVE APEUSU             TO LAPE06O                     04100001
                 PERFORM 0222-SEND-MAPMENU06                            04110001
             WHEN WS-CONS = 'SI' AND WS-BORR = 'SI' AND                 04120001
                  WS-INGR = 'NO' AND WS-MODI = 'NO'                     04130001
                 MOVE LOW-VALUE          TO MSNOP07O                    04140001
                 MOVE USU                TO LOG07O                      04150001
                 MOVE NOMUSU             TO LNOM07O                     04160001
                 MOVE APEUSU             TO LAPE07O                     04170001
                 PERFORM 0222-SEND-MAPMENU07                            04180001
             WHEN WS-CONS = 'SI' AND WS-BORR = 'SI' AND                 04190001
                  WS-INGR = 'SI' AND WS-MODI = 'NO'                     04200001
                 MOVE LOW-VALUE          TO MSNOP08O                    04210001
                 MOVE USU                TO LOG08O                      04220001
                 MOVE NOMUSU             TO LNOM08O                     04230001
                 MOVE APEUSU             TO LAPE08O                     04240001
                 PERFORM 0222-SEND-MAPMENU08                            04250001
             WHEN OTHER                                                 04260001
                   MOVE "            OJO  OPCION NO PERMITIDA "         04270001
                                             TO MSG-FIN-SESION          04280001
                   PERFORM 0300-FIN                                     04290001
           END-EVALUATE                                                 04300001
           MOVE '01'     TO CICLO                                       04310001
           PERFORM 8200-RETORNO-TRANS                                   04320001
           .                                                            04330001
      ***************************************************               04340001
      *   CICLO RECIBE LA OPCION ESCOGIDA POR EL USUARIO*               04350001
      *   Y ASIGNA EL CICLO CORRESPONDIENTE A LA OPCION *               04360001
      ***************************************************               04370001
       0202-CICLO-1.                                                    04380001
           MOVE ZEROS TO WS-OPCION                                      04390001
           EVALUATE TRUE                                                04400001
              WHEN WS-CONS = 'SI' AND WS-BORR = 'SI' AND                04410001
                   WS-INGR = 'SI' AND WS-MODI = 'SI'                    04420001
                   PERFORM 0223-RECIBE-MAPMENU03                        04430001
                   MOVE OPC03I TO WS-OPCION                             04440001
              WHEN WS-CONS = 'SI' AND WS-BORR = 'NO' AND                04450001
                   WS-INGR = 'NO' AND WS-MODI = 'SI'                    04460001
                   PERFORM 0223-RECIBE-MAPMENU04                        04470001
                   MOVE '0' TO WS-OPCION                                04480001
                   IF OPC04I = '1'                                      04490001
                     MOVE '2' TO WS-OPCION                              04500001
                   ELSE                                                 04510001
                     IF OPC04I = '2'                                    04520001
                       MOVE 3 TO WS-OPCION                              04530001
                     ELSE                                               04540001
                       IF OPC04I = '3'                                  04550001
                         MOVE 5 TO WS-OPCION                            04560001
                       END-IF                                           04570001
                     END-IF                                             04580001
                   END-IF                                               04590001
              WHEN WS-CONS = 'SI' AND WS-BORR = 'SI' AND                04600001
                   WS-INGR = 'SI' AND WS-MODI = 'NO'                    04610001
                   PERFORM 0223-RECIBE-MAPMENU08                        04620001
                   MOVE '0' TO WS-OPCION                                04630001
                   IF OPC08I = '1'                                      04640001
                     MOVE '1' TO WS-OPCION                              04650001
                     ELSE                                               04660001
                     IF OPC08I = '2'                                    04670001
                       MOVE '3' TO WS-OPCION                            04680001
                     ELSE                                               04690001
                       IF OPC08I = '3'                                  04700001
                         MOVE 4 TO WS-OPCION                            04710001
                       ELSE                                             04720001
                         IF OPC08I = '4'                                04730001
                           MOVE 5 TO WS-OPCION                          04740001
                         END-IF                                         04750001
                       END-IF                                           04760001
                     END-IF                                             04770001
                   END-IF                                               04780001
              WHEN WS-CONS = 'SI' AND WS-BORR = 'NO' AND                04790001
                   WS-INGR = 'SI' AND WS-MODI = 'NO'                    04800001
                   PERFORM 0223-RECIBE-MAPMENU06                        04810001
                   MOVE '0' TO WS-OPCION                                04820001
                   IF OPC06I = '1'                                      04830001
                     MOVE '1' TO WS-OPCION                              04840001
                   ELSE                                                 04850001
                     IF OPC06I = '2'                                    04860001
                       MOVE 3 TO WS-OPCION                              04870001
                     ELSE                                               04880001
                       IF OPC06I = '3'                                  04890001
                         MOVE 5 TO WS-OPCION                            04900001
                       END-IF                                           04910001
                     END-IF                                             04920001
                   END-IF                                               04930001
              WHEN WS-CONS = 'SI' AND WS-BORR = 'SI' AND                04940001
                   WS-INGR = 'NO' AND WS-MODI = 'NO'                    04950001
                   PERFORM 0223-RECIBE-MAPMENU07                        04960001
                   MOVE '0' TO WS-OPCION                                04970001
                   IF OPC07I = '1'                                      04980001
                     MOVE '3' TO WS-OPCION                              04990001
                   ELSE                                                 05000001
                     IF OPC07I = '2'                                    05010001
                       MOVE 4 TO WS-OPCION                              05020001
                     ELSE                                               05030001
                       IF OPC07I = '3'                                  05040001
                         MOVE 5 TO WS-OPCION                            05050001
                       END-IF                                           05060001
                     END-IF                                             05070001
                   END-IF                                               05080001
              WHEN WS-CONS = 'SI' AND WS-BORR = 'NO' AND                05090001
                   WS-INGR = 'NO' AND WS-MODI = 'NO'                    05100001
                   PERFORM 0223-RECIBE-MAPMENU05                        05110001
                   MOVE '0' TO WS-OPCION                                05120001
                   IF OPC05I = '1'                                      05130001
                     MOVE 3 TO WS-OPCION                                05140001
                   ELSE                                                 05150001
                     IF OPC05I = '2'                                    05160001
                       MOVE 5 TO WS-OPCION                              05170001
                     END-IF                                             05180001
                   END-IF                                               05190001
           END-EVALUATE                                                 05200001
           EVALUATE EIBAID                                              05210001
             WHEN DFHPF3                                                05220001
                PERFORM 0300-FIN                                        05230001
           END-EVALUATE                                                 05240001
           MOVE LOW-VALUES TO MSNES05O                                  05250001
           MOVE SPACES  TO CED                                          05260001
           MOVE SPACES  TO NOM                                          05270001
           MOVE SPACES  TO APE                                          05280001
           MOVE SPACES  TO DIR                                          05290001
           IF WS-OPCION = '1'                                           05300001
             MOVE 'ADICION DE ESTUDIANTES' TO TITO                      05310001
             MOVE 'F3=END ENTER= LEER ' TO TECO                         05320001
             MOVE '05'     TO CICLO                                     05330001
           END-IF                                                       05340001
           IF WS-OPCION  = '2'                                          05350001
             MOVE 'MODIFICACION DE ESTUDIANTES' TO TITO                 05360001
             MOVE 'F3=END ENTER= LEER' TO TECO                          05370001
             MOVE '03'     TO CICLO                                     05380001
           END-IF                                                       05390001
           IF WS-OPCION  = '3'                                          05400001
             MOVE 'CONSULTA DE ESTUDIANTES' TO TITO                     05410001
             MOVE 'F3=END ENTER= LEER F7=ANTERIOR F8=PROXIMO' TO TECO   05420001
             MOVE '02'     TO CICLO                                     05430001
             MOVE 'DA'     TO CODIGO-CURSOR                             05440001
             MOVE 'CURSOR' TO TIPO                                      05450001
             MOVE '01'     TO SUB-TIPO                                  05460001
             MOVE 'ESTUD'  TO TIPOUSUA                                  05470001
             PERFORM 9000-PROCESE-CRUD                                  05480001
           END-IF                                                       05490001
           IF WS-OPCION  = '4'                                          05500001
             MOVE 'RETIRO DE ESTUDIANTES' TO TITO                       05510001
             MOVE 'F3=END ENTER= LEER ' TO TECO                         05520001
             MOVE '07'     TO CICLO                                     05530001
           END-IF                                                       05540001
           IF WS-OPCION  = '5'                                          05550001
             MOVE '09'     TO CICLO                                     05560001
             MOVE SPACES TO CED                                         05570001
             PERFORM 0210-CICLO-9                                       05580001
           END-IF                                                       05590001
           IF WS-OPCION  < '1' OR  WS-OPCION  > '5'                     05600001
             EVALUATE TRUE                                              05610001
               WHEN WS-CONS = 'SI' AND WS-BORR = 'SI' AND               05620001
                    WS-INGR = 'SI' AND WS-MODI = 'SI'                   05630001
                 MOVE " OPCION NO PERMITIDA" TO MSG03O                  05640001
                 MOVE USU        TO LOG03O                              05650001
                 MOVE NOMUSU     TO LNOM03O                             05660001
                 MOVE APEUSU     TO LAPE03O                             05670001
                 PERFORM 0222-SEND-MAPMENU03                            05680001
               WHEN WS-CONS = 'SI' AND WS-BORR = 'NO' AND               05690001
                    WS-INGR = 'NO' AND WS-MODI = 'SI'                   05700001
                 MOVE " OPCION NO PERMITIDA" TO MSG04O                  05710001
                 MOVE USU        TO LOG04O                              05720001
                 MOVE NOMUSU     TO LNOM04O                             05730001
                 MOVE APEUSU     TO LAPE04O                             05740001
                 PERFORM 0222-SEND-MAPMENU04                            05750001
               WHEN WS-CONS = 'SI' AND WS-BORR = 'NO' AND               05760001
                    WS-INGR = 'NO' AND WS-MODI = 'NO'                   05770001
                   MOVE " OPCION NO PERMITIDA" TO MSG05O                05780001
                   MOVE USU        TO LOG05O                            05790001
                   MOVE NOMUSU     TO LNOM05O                           05800001
                   MOVE APEUSU     TO LAPE05O                           05810001
                   PERFORM 0222-SEND-MAPMENU05                          05820001
               WHEN WS-CONS = 'SI' AND WS-BORR = 'NO' AND               05830001
                    WS-INGR = 'SI' AND WS-MODI = 'NO'                   05840001
                   MOVE " OPCION NO PERMITIDA" TO MSG06O                05850001
                   MOVE USU        TO LOG06O                            05860001
                   MOVE NOMUSU     TO LNOM06O                           05870001
                   MOVE APEUSU     TO LAPE06O                           05880001
                   PERFORM 0222-SEND-MAPMENU06                          05890001
               WHEN WS-CONS = 'SI' AND WS-BORR = 'SI' AND               05900001
                    WS-INGR = 'NO' AND WS-MODI = 'NO'                   05910001
                   MOVE " OPCION NO PERMITIDA" TO MSG07O                05920001
                   MOVE USU        TO LOG07O                            05930001
                   MOVE NOMUSU     TO LNOM07O                           05940001
                   MOVE APEUSU     TO LAPE07O                           05950001
                   PERFORM 0222-SEND-MAPMENU07                          05960001
               WHEN WS-CONS = 'SI' AND WS-BORR = 'SI' AND               05970001
                    WS-INGR = 'SI' AND WS-MODI = 'NO'                   05980001
                   MOVE " OPCION NO PERMITIDA" TO MSG08O                05990001
                   MOVE USU        TO LOG08O                            06000001
                   MOVE NOMUSU     TO LNOM08O                           06010001
                   MOVE APEUSU     TO LAPE08O                           06020001
                   PERFORM 0222-SEND-MAPMENU08                          06030001
             END-EVALUATE                                               06040001
             MOVE '01' TO CICLO                                         06050001
             PERFORM 8200-RETORNO-TRANS                                 06060001
           END-IF                                                       06070001
           MOVE USU        TO LOG5O                                     06080001
           MOVE NOMUSU     TO LNOM5O                                    06090001
           MOVE APEUSU     TO LAPE5O                                    06100001
           PERFORM 0224-SEND-MAP                                        06110001
           PERFORM 8200-RETORNO-TRANS                                   06120001
           .                                                            06130001
      ***************************************************               06140001
      *   EN ESTE CICLO REALIZAMOS LAS CONSULTAS YA SEA *               06150001
      * INDIVIDUAL , SIGUIENTE O ANTERIOR               *               06160001
      ***************************************************               06170001
       0203-CICLO-2.                                                    06180001
           PERFORM 0225-RECIBE-MAP                                      06190001
           MOVE 'ESTUD' TO TIPOUSUA                                     06200001
           MOVE CEDI TO CED                                             06210001
           EVALUATE EIBAID                                              06220001
             WHEN DFHENTER                                              06230001
                PERFORM 0250-PROCESE-CONS                               06240001
             WHEN DFHPF8                                                06250001
                PERFORM 0251-PROCESE-PROXIMO                            06260001
             WHEN DFHPF7                                                06270001
                PERFORM 0252-PROCESE-ANTERIOR                           06280001
             WHEN OTHER                                                 06290001
                MOVE 'CONSULTA DE ESTUDIANTES' TO TITO                  06300001
                MOVE 'F3=END ENTER= LEER F7=ANTERIOR F8=PROXIMO'        06310001
                     TO TECO                                            06320001
                PERFORM 0232-VALIDE-MENUPF3                             06330001
           END-EVALUATE                                                 06340001
           .                                                            06350001
      **************************************************                06360001
      * CAPTURAMOS EL CODIGO DE ESTUDIANTE Y SI EXISTE *                06370001
      * CONTINUAMOS CON EL UPDATE EN EL CICLO 4        *                06380001
      **************************************************                06390001
       0204-CICLO-3.                                                    06400001
           PERFORM 0225-RECIBE-MAP                                      06410001
           IF EIBAID NOT EQUAL DFHENTER THEN                            06420001
             MOVE 'MODIFICACION DE ESTUDIANTES' TO TITO                 06430001
             MOVE SPACES  TO CED CEDO                                   06440001
             MOVE SPACES  TO NOM NOMO                                   06450001
             MOVE SPACES  TO APE APEO                                   06460001
             MOVE SPACES  TO DIR DIRO                                   06470001
             PERFORM 0232-VALIDE-MENUPF3                                06480001
           END-IF                                                       06490001
      *    PERFORM VALIDE-CEDI                                          06500001
           MOVE 'ESTUD' TO TIPOUSUA                                     06510001
           MOVE CEDI TO CED                                             06520001
           MOVE SPACES TO NOM APE DIR EXISTE                            06530001
           MOVE 'SELECT' TO TIPO                                        06540001
           MOVE '01' TO SUB-TIPO                                        06550001
           PERFORM 9000-PROCESE-CRUD                                    06560001
           MOVE LOW-VALUES TO MSNES05I                                  06570001
           IF EXISTE = '0'  THEN                                        06580001
             MOVE 'MODIFICACION DE ESTUDIANTES' TO TITO                 06590001
             MOVE 'ENTRE DATOS A MODIFICAR' TO MSGO                     06600001
             MOVE 'F3=END ENTER= MODIFICAR' TO TECO                     06610001
             PERFORM DESPROTEJA-CAMPOS                                  06620001
             PERFORM MOVER-ETIQUETAS                                    06630001
             PERFORM MOVER-SELECT                                       06640001
             PERFORM 0224-SEND-MAP1                                     06650001
             MOVE '04' TO CICLO                                         06660001
           ELSE                                                         06670001
             MOVE 'MODIFICACION DE ESTUDIANTES' TO TITO                 06680001
             MOVE 'EL ESTUDIANTE NO EXISTE   ' TO MSGO                  06690001
             MOVE 'F3=END ENTER= MODIFICAR' TO TECO                     06700001
             PERFORM MOVER-NO-EXISTE                                    06710001
             PERFORM 0224-SEND-MAP1                                     06720001
             MOVE    '03' TO CICLO                                      06730001
           END-IF                                                       06740001
           PERFORM 8200-RETORNO-TRANS                                   06750001
           .                                                            06760001
      ********************************************************          06770001
      * VALIDAMOS INFORMACION Y REALIZAMOS  EL UPDATE        *          06780001
      * LOS CAMPOS QUE NO SE DIGITARON SE RESPETA SU VALOR   *          06790001
      ********************************************************          06800001
       0205-CICLO-4.                                                    06810001
           PERFORM 0225-RECIBE-MAP                                      06820001
           IF EIBAID NOT EQUAL DFHENTER THEN                            06830001
             MOVE 'MOFIFICACION DE ESTUDIANTES' TO TITO                 06840001
             PERFORM MOVER-ETIQUETAS                                    06850001
             PERFORM DESPROTEJA-CAMPOS                                  06860001
             PERFORM 0232-VALIDE-MENUPF3                                06870001
           END-IF                                                       06880001
           IF CEDI = LOW-VALUES AND CED NOT = SPACES                    06890001
              MOVE CED TO CEDI                                          06900001
           END-IF                                                       06910001
           IF NOMI = LOW-VALUES AND NOM NOT = SPACES                    06920001
              MOVE NOM TO NOMI                                          06930001
           END-IF                                                       06940001
           IF APEI = LOW-VALUES AND APE NOT = SPACES                    06950001
              MOVE APE TO APEI                                          06960001
           END-IF                                                       06970001
           IF DIRI = LOW-VALUES AND DIR NOT = SPACES                    06980001
              MOVE DIR TO DIRI                                          06990001
           END-IF                                                       07000001
           MOVE '04' TO CICLO                                           07010001
           PERFORM   VALIDE-NOMI                                        07020001
           PERFORM   VALIDE-APEI                                        07030001
           PERFORM   VALIDE-DIRI                                        07040001
           PERFORM   0253-MOD-FILE                                      07050001
           MOVE '03' TO CICLO                                           07060001
           MOVE 'ESTUD' TO TIPOUSUA                                     07070001
           MOVE CEDI TO CED                                             07080001
           PERFORM   0224-SEND-MAP1                                     07090001
           PERFORM   8200-RETORNO-TRANS                                 07100001
           .                                                            07110001
      *******************************************************           07120001
      *   EN ESTE CICLO Y EL CICLO 6 SE PERMITE CREAR UN    *           07130001
      *   REGISTRO                                          *           07140001
      *******************************************************           07150001
       0206-CICLO-5.                                                    07160001
           PERFORM 0225-RECIBE-MAP                                      07170001
           IF EIBAID NOT EQUAL DFHENTER THEN                            07180001
             MOVE 'ADICION DE ESTUDIANTES' TO TITO                      07190001
             MOVE SPACES  TO CED CEDO                                   07200001
             MOVE SPACES  TO NOM NOMO                                   07210001
             MOVE SPACES  TO APE APEO                                   07220001
             MOVE SPACES  TO DIR DIRO                                   07230001
             MOVE 'F3=END ENTER= ADICIONAR ' TO TECO                    07240001
             PERFORM 0232-VALIDE-MENUPF3                                07250001
           END-IF                                                       07260001
           PERFORM VALIDE-CEDI                                          07270001
           MOVE 'ESTUD' TO TIPOUSUA                                     07280001
           MOVE CEDI TO CED                                             07290001
           MOVE SPACES TO NOM APE DIR EXISTE                            07300001
           MOVE 'SELECT' TO TIPO                                        07310001
           MOVE '01' TO SUB-TIPO                                        07320001
           PERFORM 9000-PROCESE-CRUD                                    07330001
           MOVE LOW-VALUES TO MSNES05I                                  07340001
           MOVE CED  TO CEDI                                            07350001
           IF EXISTE = '1'  THEN                                        07360001
             PERFORM DESPROTEJA-CAMPOS                                  07370001
             MOVE 'ADICION DE ESTUDIANTES' TO TITO                      07380001
             MOVE 'ENTRE DATOS            ' TO MSGO                     07390001
             MOVE 'F3=END ENTER= ADICIONAR ' TO TECO                    07400001
             PERFORM MOVER-ETIQUETAS                                    07410001
             MOVE SPACES TO NOM APE DIR                                 07420001
             PERFORM 0224-SEND-MAP1                                     07430001
             MOVE '06' TO CICLO                                         07440001
           ELSE                                                         07450001
             MOVE 'ADICION DE ESTUDIANTES' TO TITO                      07460001
             MOVE 'EL ESTUDIANTE YA EXISTE'                             07470001
                                            TO MSGO                     07480001
             MOVE 'F3=END ENTER= LEER     ' TO TECO                     07490001
             MOVE SPACES TO NOM APE DIR                                 07500001
             PERFORM 0224-SEND-MAP1                                     07510001
             MOVE    '05' TO CICLO                                      07520001
           END-IF                                                       07530001
           PERFORM 8200-RETORNO-TRANS                                   07540001
           .                                                            07550001
      ********************************************************          07560001
      * REALIZAMOS EL INSERT TENIENDO VALIDANDO LOS CAMPOS   *          07570001
      * DIGITADOS QUE SON OBLIGATORIOS                       *          07580001
      ********************************************************          07590001
       0207-CICLO-6.                                                    07600001
           PERFORM 0225-RECIBE-MAP                                      07610001
           IF EIBAID NOT EQUAL DFHENTER THEN                            07620001
             MOVE 'ADICION DE ESTUDIANTES' TO TITO                      07630001
             PERFORM MOVER-ETIQUETAS                                    07640001
             PERFORM DESPROTEJA-CAMPOS                                  07650001
             PERFORM 0232-VALIDE-MENUPF3                                07660001
           END-IF                                                       07670001
           IF NOMI = LOW-VALUES AND NOM NOT = SPACES                    07680001
              MOVE NOM TO NOMI                                          07690001
           END-IF                                                       07700001
           IF APEI = LOW-VALUES AND APE NOT = SPACES                    07710001
              MOVE APE TO APEI                                          07720001
           END-IF                                                       07730001
           IF DIRI = LOW-VALUES AND DIR NOT = SPACES                    07740001
              MOVE DIR TO DIRI                                          07750001
           END-IF                                                       07760001
           MOVE CED  TO CEDI                                            07770001
           MOVE '06' TO CICLO                                           07780001
           PERFORM      VALIDE-NOMI                                     07790001
           PERFORM      VALIDE-APEI                                     07800001
           PERFORM      VALIDE-DIRI                                     07810001
           PERFORM      0254-INS-FILE                                   07820001
           MOVE '05' TO CICLO                                           07830001
           MOVE CEDI TO CED                                             07840001
           PERFORM   0224-SEND-MAP1                                     07850001
           PERFORM   8200-RETORNO-TRANS                                 07860001
           .                                                            07870001
      *********************************************************         07880001
      * EN ESTE CICLO Y CICLO-7 SE REALIZA LA OPERACION RETIRO*         07890001
      * VERIFICANDO QUE EL REGISTRO A RETIRAR EXISTA          *         07900001
      *********************************************************         07910001
       0208-CICLO-7.                                                    07920001
           PERFORM 0225-RECIBE-MAP                                      07930001
           IF EIBAID NOT EQUAL DFHENTER THEN                            07940001
              MOVE 'RETIRO  DE ESTUDIANTES' TO TITO                     07950001
              MOVE SPACES  TO CED CEDO                                  07960001
              MOVE SPACES  TO NOM NOMO                                  07970001
              MOVE SPACES  TO APE APEO                                  07980001
              MOVE SPACES  TO DIR DIRO                                  07990001
              PERFORM 0232-VALIDE-MENUPF3                               08000001
           END-IF                                                       08010001
           MOVE CEDI TO CED                                             08020001
      *    PERFORM VALIDE-CEDI                                          08030001
           MOVE 'ESTUD' TO TIPOUSUA                                     08040001
           MOVE CEDI TO CED                                             08050001
           MOVE SPACES TO NOM APE DIR EXISTE                            08060001
           MOVE 'SELECT' TO TIPO                                        08070001
           MOVE '01' TO SUB-TIPO                                        08080001
           PERFORM 9000-PROCESE-CRUD                                    08090001
           MOVE LOW-VALUES TO MSNES05I                                  08100001
           IF EXISTE = '0'  THEN                                        08110001
             MOVE CED TO LK-PM-DNI                                      08120001
             PERFORM 0260-LEA-PERMISOS                                  08130001
             IF EXISTE = '0'                                            08140001
               MOVE 'RETIRO  DE ESTUDIANTES' TO TITO                    08150001
               MOVE 'ESTUDIANTE CON PERMISOS,RETIRE SUS PERMISOS'       08160001
                    TO MSGO                                             08170001
               MOVE 'F3=END ENTER= LEER     ' TO TECO                   08180001
               PERFORM MOVER-NO-EXISTE                                  08190001
               PERFORM 0224-SEND-MAP1                                   08200001
               MOVE    '07' TO CICLO                                    08210001
             ELSE                                                       08220001
               PERFORM MOVER-SELECT                                     08230001
               MOVE 'RETIRO  DE ESTUDIANTES' TO TITO                    08240001
               MOVE 'PRESIONE ENTER PARA RETIRAR' TO MSGO               08250001
               PERFORM MOVER-ETIQUETAS                                  08260001
               MOVE 'F3=END ENTER= RETIRAR  ' TO TECO                   08270001
               PERFORM 0224-SEND-MAP1                                   08280001
               MOVE '08' TO CICLO                                       08290001
             END-IF                                                     08300001
           ELSE                                                         08310001
             MOVE 'RETIRO  DE ESTUDIANTES' TO TITO                      08320001
             MOVE 'EL ESTUDIANTE NO EXISTE   ' TO MSGO                  08330001
             MOVE 'F3=END ENTER= LEER     ' TO TECO                     08340001
             PERFORM MOVER-NO-EXISTE                                    08350001
             PERFORM 0224-SEND-MAP1                                     08360001
             MOVE    '07' TO CICLO                                      08370001
           END-IF                                                       08380001
           PERFORM 8200-RETORNO-TRANS                                   08390001
           .                                                            08400001
      *********************************************************         08410001
      * COMO EL REGISTRO A RETIRAR EXISTE PROCEDEMOS CON EL   *         08420001
      * RETIRO EN LA BASE DE DATOS                            *         08430001
      *********************************************************         08440001
       0209-CICLO-8.                                                    08450001
           PERFORM 0225-RECIBE-MAP                                      08460001
           IF EIBAID NOT EQUAL DFHENTER THEN                            08470001
             MOVE 'RETIRO  DE ESTUDIANTES' TO TITO                      08480001
             PERFORM MOVER-ETIQUETAS                                    08490001
             PERFORM PROTEJA-MAPA                                       08500001
             MOVE 'F3=END ENTER= RETIRAR  ' TO TECO                     08510001
             PERFORM 0232-VALIDE-MENUPF3                                08520001
           END-IF                                                       08530001
           MOVE CEDI TO CED                                             08540001
           MOVE NOMI TO NOM                                             08550001
           MOVE APEI TO APE                                             08560001
           MOVE DIRI TO DIR                                             08570001
           PERFORM 0255-RET-FILE                                        08580001
           MOVE '07' TO CICLO                                           08590001
           MOVE CEDI TO CED                                             08600001
           PERFORM   0224-SEND-MAP1                                     08610001
           PERFORM   8200-RETORNO-TRANS                                 08620001
           .                                                            08630001
      ********************************************************          08640001
      * LLAMA AL PROGRAMA QUE PERMITE CONSULTAR VARIOS       *          08650001
      *                REGISTROS                             *          08660001
      ********************************************************          08670001
       0210-CICLO-9.                                                    08680001
           EXEC CICS                                                    08690001
                SET TERMINAL(EIBTRMID) UCTRAN                           08700001
           END-EXEC                                                     08710001
           IF WS-CONS = 'SI' AND WS-BORR = 'NO' AND                     08720001
              WS-INGR = 'NO' AND WS-MODI = 'NO'                         08730001
              PERFORM 0300-FIN                                          08740001
           END-IF                                                       08750001
           MOVE '99'     TO CICLO                                       08760001
           MOVE 'SN06'     TO TRANS                                     08770001
           MOVE ZEROS  TO NUM-REGISTRO CONTADOR-REGISTRO                08780001
           MOVE SPACES TO   CODIGO-CURSOR MLIKE                         08790001
           EXEC CICS XCTL                                               08800001
                PROGRAM('PSNEST06')                                     08810001
                COMMAREA(MI-COMMAREA)                                   08820001
                LENGTH(LENGTH OF MI-COMMAREA)                           08830001
                RESP(RESPUESTA)                                         08840001
           END-EXEC                                                     08850001
           EXEC CICS RETURN                                             08860001
           END-EXEC                                                     08870001
           GOBACK                                                       08880001
           .                                                            08890001
      **************************************************                08900001
      * CAPTURAMOS EL CODIGO DE ESTUDIANTE Y SI EXISTE *                08910001
      * CONTINUAMOS CON EL UPDATE EN EL CICLO 4        *                08920001
      **************************************************                08930001
       0210-CICLO-20.                                                   08940001
           MOVE 'ESTUD' TO TIPOUSUA                                     08950001
           MOVE CED  TO CEDI                                            08960001
           MOVE SPACES TO NOM APE DIR EXISTE                            08970001
           MOVE 'SELECT' TO TIPO                                        08980001
           MOVE '01' TO SUB-TIPO                                        08990001
           PERFORM 9000-PROCESE-CRUD                                    09000001
           MOVE LOW-VALUES TO MSNES05I                                  09010001
           IF EXISTE = '0'  THEN                                        09020001
             MOVE 'CONSULTA DE ESTUDIANTES' TO TITO                     09030001
             MOVE SPACES                    TO MSGO                     09040001
             MOVE 'F3=END                 ' TO TECO                     09050001
             PERFORM MOVER-ETIQUETAS                                    09060001
             PERFORM MOVER-SELECT                                       09070001
             MOVE '09' TO CICLO                                         09080001
             MOVE CEDI TO CED                                           09090001
             PERFORM PROTEJA-CEDI                                       09100001
             PERFORM 0224-SEND-MAP1                                     09110001
             PERFORM 8200-RETORNO-TRANS                                 09120001
           ELSE                                                         09130001
             MOVE 'CONSULTA DE ESTUDIANTES' TO TITO                     09140001
             MOVE 'EL ESTUDIANTE NO EXISTE   ' TO MSGO                  09150001
             MOVE 'F3=END                 ' TO TECO                     09160001
             PERFORM MOVER-NO-EXISTE                                    09170001
             PERFORM 0224-SEND-MAP1                                     09180001
             MOVE    '09' TO CICLO                                      09190001
             PERFORM 8200-RETORNO-TRANS                                 09200001
           END-IF                                                       09210001
           .                                                            09220001
      **************************************************                09230001
      * CAPTURAMOS EL CODIGO DE ESTUDIANTE Y SI EXISTE *                09240001
      * CONTINUAMOS CON EL UPDATE EN EL CICLO 4        *                09250001
      **************************************************                09260001
       0210-CICLO-30.                                                   09270001
           MOVE LOW-VALUES TO MSNES05I                                  09280001
           MOVE 'ESTUD' TO TIPOUSUA                                     09290001
           MOVE CED  TO CEDI                                            09300001
           MOVE 'SELECT' TO TIPO                                        09310001
           MOVE '01' TO SUB-TIPO                                        09320001
           MOVE SPACES TO NOMI APEI DIRI EXISTE                         09330001
           PERFORM 9000-PROCESE-CRUD                                    09340001
           IF EXISTE = '0'  THEN                                        09350001
             MOVE 'MODIFICACION DE ESTUDIANTES' TO TITI                 09360001
             MOVE 'ENTRE DATOS A MODIFICAR' TO MSGI                     09370001
             MOVE 'F3=END ENTER= MOFIFICAR' TO TECI                     09380001
             PERFORM DESPROTEJA-CAMPOS                                  09390001
             PERFORM MOVER-ETIQUETAS                                    09400001
             PERFORM MOVER-SELECT                                       09410001
             MOVE '31' TO CICLO                                         09420001
             PERFORM 0224-SEND-MAP1                                     09430001
             PERFORM   8200-RETORNO-TRANS                               09440001
           ELSE                                                         09450001
             MOVE 'MODIFICACION DE ESTUDIANTES' TO TITO                 09460001
             MOVE 'EL ESTUDIANTE NO EXISTE   ' TO MSGO                  09470001
             MOVE 'F3=END ENTER= MODIFICAR' TO TECO                     09480001
             PERFORM MOVER-NO-EXISTE                                    09490001
             MOVE    '09' TO CICLO                                      09500001
             PERFORM 0224-SEND-MAP1                                     09510001
             PERFORM 8200-RETORNO-TRANS                                 09520001
           END-IF                                                       09530001
           .                                                            09540001
      ********************************************************          09550001
      * VALIDAMOS INFORMACION Y REALIZAMOS  EL UPDATE        *          09560001
      * LOS CAMPOS QUE NO SE DIGITARON SE RESPETA SU VALOR   *          09570001
      ********************************************************          09580001
       0210-CICLO-31.                                                   09590001
           PERFORM 0225-RECIBE-MAP                                      09600001
           IF EIBAID NOT EQUAL DFHENTER THEN                            09610001
               MOVE LOW-VALUES TO MSNES05O                              09620001
               MOVE 'MODIFICACION DE ESTUDIANTES' TO TITO               09630001
               MOVE 'ESTUDIANTE SIN CAMBIOS'                            09640001
                    TO MSGO                                             09650001
              PERFORM 0232-VALIDE-SCROLLPF3                             09660001
           END-IF                                                       09670001
           MOVE CED TO CEDI                                             09680001
      *      MOVE 'EIBCPOS'     TO T-PAS                                09690001
           IF (NOMI = LOW-VALUES OR NOML = ZEROS OR NOML > 20) AND      09700001
               NOM NOT = SPACES                                         09710001
              MOVE NOM TO NOMI                                          09720001
           END-IF                                                       09730001
           IF (APEI = LOW-VALUES OR APEL = ZEROS OR APEL > 20) AND      09740001
              APE NOT = SPACES                                          09750001
              MOVE APE TO APEI                                          09760001
           END-IF                                                       09770001
           IF (DIRI = LOW-VALUES OR DIRL = ZEROS OR DIRL > 35) AND      09780001
              DIR NOT = SPACES                                          09790001
              MOVE DIR TO DIRI                                          09800001
           END-IF                                                       09810001
           PERFORM   VALIDE-NOMI                                        09820001
           PERFORM   VALIDE-APEI                                        09830001
           PERFORM   VALIDE-DIRI                                        09840001
           MOVE CED  TO CEDI                                            09850001
           PERFORM   0253-MOD-FILE                                      09860001
           MOVE '09' TO CICLO                                           09870001
           MOVE CEDI TO CED                                             09880001
           PERFORM PROTEJA-CEDI                                         09890001
           PERFORM 0224-SEND-MAP1                                       09900001
           PERFORM 8200-RETORNO-TRANS                                   09910001
           .                                                            09920001
      *******************************************************           09930001
      *   EN ESTE CICLO LEEMOS EL CODIGO A INGRESAR         *           09940001
      *******************************************************           09950001
       0210-CICLO-50.                                                   09960001
           MOVE LOW-VALUES TO MSNES05O                                  09970001
           MOVE SPACES TO CED NOM APE DIR                               09980001
           MOVE 51 TO CICLO                                             09990001
           MOVE USU        TO LOG5O                                     10000001
           MOVE NOMUSU     TO LNOM5O                                    10010001
           MOVE APEUSU     TO LAPE5O                                    10020001
           MOVE 'ADICION DE ESTUDIANTES' TO TITO                        10030001
           MOVE 'ENTRE DATOS            ' TO MSGO                       10040001
           MOVE 'F3=END ENTER= ADICIONAR ' TO TECO                      10050001
           PERFORM 0224-SEND-MAP                                        10060001
           PERFORM 8200-RETORNO-TRANS                                   10070001
           .                                                            10080001
      *******************************************************           10090001
      *   EN ESTE CICLO Y EL CICLO 6 SE PERMITE CREAR UN    *           10100001
      *   REGISTRO                                          *           10110001
      *******************************************************           10120001
       0210-CICLO-51.                                                   10130001
           PERFORM 0225-RECIBE-MAP                                      10140001
           IF EIBAID NOT EQUAL DFHENTER THEN                            10150001
               MOVE LOW-VALUES TO MSNES05O                              10160001
               MOVE 'ADICION DE ESTUDIANTES' TO TITO                    10170001
               MOVE 'ESTUDIANTE NO SE CREA  '                           10180001
                    TO MSGO                                             10190001
               PERFORM 0232-VALIDE-SCROLLPF3                            10200001
           END-IF                                                       10210001
           PERFORM VALIDE-CEDI                                          10220001
           MOVE 'ESTUD' TO TIPOUSUA                                     10230001
           MOVE CEDI TO CED                                             10240001
           MOVE SPACES TO NOM APE DIR EXISTE                            10250001
           MOVE 'SELECT' TO TIPO                                        10260001
           MOVE '01' TO SUB-TIPO                                        10270001
           PERFORM 9000-PROCESE-CRUD                                    10280001
           MOVE LOW-VALUES TO MSNES05I                                  10290001
           MOVE CED  TO CEDI                                            10300001
           IF EXISTE = '1'  THEN                                        10310001
             PERFORM DESPROTEJA-CAMPOS                                  10320001
             MOVE 'ADICION DE ESTUDIANTES' TO TITO                      10330001
             MOVE 'ENTRE DATOS            ' TO MSGO                     10340001
             MOVE 'F3=END ENTER= ADICIONAR ' TO TECO                    10350001
             PERFORM MOVER-ETIQUETAS                                    10360001
             MOVE SPACES TO NOM APE DIR                                 10370001
             PERFORM 0224-SEND-MAP1                                     10380001
             MOVE '52' TO CICLO                                         10390001
           ELSE                                                         10400001
             MOVE 'ADICION DE ESTUDIANTES' TO TITO                      10410001
             MOVE 'EL ESTUDIANTE YA EXISTE'                             10420001
                                            TO MSGO                     10430001
             MOVE 'F3=END ENTER= LEER     ' TO TECO                     10440001
             MOVE SPACES TO NOM APE DIR                                 10450001
             PERFORM 0224-SEND-MAP1                                     10460001
             MOVE    '09' TO CICLO                                      10470001
           END-IF                                                       10480001
           PERFORM 8200-RETORNO-TRANS                                   10490001
           .                                                            10500001
      ********************************************************          10510001
      * REALIZAMOS EL INSERT TENIENDO VALIDANDO LOS CAMPOS   *          10520001
      * DIGITADOS QUE SON OBLIGATORIOS                       *          10530001
      ********************************************************          10540001
       0210-CICLO-52.                                                   10550001
           PERFORM 0225-RECIBE-MAP                                      10560001
           IF EIBAID NOT EQUAL DFHENTER THEN                            10570001
               MOVE LOW-VALUES TO MSNES05O                              10580001
               MOVE 'ADICION DE ESTUDIANTES' TO TITO                    10590001
               MOVE 'ESTUDIANTE NO SE CREA  '                           10600001
                    TO MSGO                                             10610001
                PERFORM 0232-VALIDE-SCROLLPF3                           10620001
           END-IF                                                       10630001
           IF NOMI = LOW-VALUES AND NOM NOT = SPACES                    10640001
              MOVE NOM TO NOMI                                          10650001
           END-IF                                                       10660001
           IF APEI = LOW-VALUES AND APE NOT = SPACES                    10670001
              MOVE APE TO APEI                                          10680001
           END-IF                                                       10690001
           IF DIRI = LOW-VALUES AND DIR NOT = SPACES                    10700001
              MOVE DIR TO DIRI                                          10710001
           END-IF                                                       10720001
           MOVE CED  TO CEDI                                            10730001
           MOVE '52' TO CICLO                                           10740001
           PERFORM      VALIDE-NOMI                                     10750001
           PERFORM      VALIDE-APEI                                     10760001
           PERFORM      VALIDE-DIRI                                     10770001
           PERFORM      0254-INS-FILE                                   10780001
           MOVE '09' TO CICLO                                           10790001
           MOVE CEDI TO CED                                             10800001
           PERFORM PROTEJA-CEDI                                         10810001
           PERFORM   0224-SEND-MAP1                                     10820001
           PERFORM   8200-RETORNO-TRANS                                 10830001
           .                                                            10840001
      *********************************************************         10850001
      * EN ESTE CICLO Y CICLO-7 SE REALIZA LA OPERACION RETIRO*         10860001
      * VERIFICANDO QUE EL REGISTRO A RETIRAR EXISTA          *         10870001
      *********************************************************         10880001
       0208-CICLO-70.                                                   10890001
           MOVE 'ESTUD'  TO TIPOUSUA                                    10900001
           MOVE CED      TO CEDI                                        10910001
           MOVE SPACES   TO NOM APE DIR EXISTE                          10920001
           MOVE 'SELECT' TO TIPO                                        10930001
           MOVE '01'     TO SUB-TIPO                                    10940001
           PERFORM 9000-PROCESE-CRUD                                    10950001
           MOVE LOW-VALUES TO MSNES05I                                  10960001
           IF EXISTE = '0'  THEN                                        10970001
             PERFORM MOVER-SELECT                                       10980001
             MOVE 'RETIRO  DE ESTUDIANTES' TO TITO                      10990001
             MOVE 'PRESIONE ENTER PARA RETIRAR' TO MSGO                 11000001
             PERFORM MOVER-ETIQUETAS                                    11010001
             MOVE 'F3=END ENTER= RETIRAR  ' TO TECO                     11020001
             MOVE '71' TO CICLO                                         11030001
             PERFORM 0224-SEND-MAP1                                     11040001
           ELSE                                                         11050001
             MOVE 'RETIRO  DE ESTUDIANTES' TO TITO                      11060001
             MOVE 'EL ESTUDIANTE NO EXISTE   ' TO MSGO                  11070001
             MOVE 'F3=END ENTER= LEER     ' TO TECO                     11080001
             PERFORM MOVER-NO-EXISTE                                    11090001
             PERFORM 0224-SEND-MAP1                                     11100001
             MOVE    '09' TO CICLO                                      11110001
           END-IF                                                       11120001
           PERFORM 8200-RETORNO-TRANS                                   11130001
           .                                                            11140001
      *********************************************************         11150001
      * COMO EL REGISTRO A RETIRAR EXISTE PROCEDEMOS CON EL   *         11160001
      * RETIRO EN LA BASE DE DATOS                            *         11170001
      *********************************************************         11180001
       0209-CICLO-71.                                                   11190001
           PERFORM 0225-RECIBE-MAP                                      11200001
           IF EIBAID NOT EQUAL DFHENTER THEN                            11210001
               MOVE LOW-VALUES TO MSNES05O                              11220001
               MOVE 'RETIRO  DE ESTUDIANTES' TO TITO                    11230001
               MOVE 'ESTUDIANTE NO SE RETIRA'                           11240001
                    TO MSGO                                             11250001
             PERFORM 0232-VALIDE-SCROLLPF3                              11260001
           END-IF                                                       11270001
           MOVE CED  TO CEDI                                            11280001
           MOVE NOM  TO NOMI                                            11290001
           MOVE APE  TO APEI                                            11300001
           MOVE DIR  TO DIRI                                            11310001
           PERFORM 0255-RET-FILE                                        11320001
           MOVE '09' TO CICLO                                           11330001
           MOVE CEDI TO CED                                             11340001
           PERFORM PROTEJA-CEDI                                         11350001
           PERFORM   0224-SEND-MAP1                                     11360001
           PERFORM   8200-RETORNO-TRANS                                 11370001
           .                                                            11380001
      *****************************************                         11390001
      * EN ESTA SECCION ESTAN AGRUPADO TODO   *                         11400001
      * LO RELACIONADO CON MAPAS              *                         11410001
      *****************************************                         11420001
      *                                                                 11430001
      *                                                                 11440001
      *****************************************                         11450001
      * MAP MENU SIRVE PARA ESCOGER OPCIONES  *                         11460001
      * DEL MENU                              *                         11470001
      *****************************************                         11480001
       0222-SEND-MAPMENU03.                                             11490001
           EXEC CICS                                                    11500001
                SEND MAP('MSNOP03') MAPSET('MSNOP03')                   11510001
                     ERASE                                              11520001
                     FROM(MSNOP03O)                                     11530001
                     NOHANDLE                                           11540001
           END-EXEC                                                     11550001
           .                                                            11560001
       0223-RECIBE-MAPMENU03.                                           11570001
           EXEC CICS RECEIVE MAP('MSNOP03')                             11580001
                INTO(MSNOP03I)                                          11590001
                NOHANDLE                                                11600001
           END-EXEC                                                     11610001
           EXEC CICS                                                    11620001
                IGNORE CONDITION MAPFAIL                                11630001
           END-EXEC                                                     11640001
           .                                                            11650001
      *                                                                 11660001
      *                                                                 11670001
      *****************************************                         11680001
      * MAP MENU SIRVE PARA ESCOGER OPCIONES  *                         11690001
      * DEL MENU                              *                         11700001
      *****************************************                         11710001
       0222-SEND-MAPMENU04.                                             11720001
           EXEC CICS                                                    11730001
                SEND MAP('MSNOP04') MAPSET('MSNOP04')                   11740001
                     ERASE                                              11750001
                     FROM(MSNOP04O)                                     11760001
                     NOHANDLE                                           11770001
           END-EXEC                                                     11780001
           .                                                            11790001
       0223-RECIBE-MAPMENU04.                                           11800001
           EXEC CICS RECEIVE MAP('MSNOP04')                             11810001
                INTO(MSNOP04I)                                          11820001
                NOHANDLE                                                11830001
           END-EXEC                                                     11840001
           EXEC CICS                                                    11850001
                IGNORE CONDITION MAPFAIL                                11860001
           END-EXEC                                                     11870001
           .                                                            11880001
      *                                                                 11890001
      *                                                                 11900001
      *****************************************                         11910001
      * MAP MENU SIRVE PARA ESCOGER OPCIONES  *                         11920001
      * DEL MENU                              *                         11930001
      *****************************************                         11940001
       0222-SEND-MAPMENU05.                                             11950001
           EXEC CICS                                                    11960001
                SEND MAP('MSNOP05') MAPSET('MSNOP05')                   11970001
                     ERASE                                              11980001
                     FROM(MSNOP05O)                                     11990001
                     NOHANDLE                                           12000001
           END-EXEC                                                     12010001
           .                                                            12020001
       0223-RECIBE-MAPMENU05.                                           12030001
           EXEC CICS RECEIVE MAP('MSNOP05')                             12040001
                INTO(MSNOP05I)                                          12050001
                NOHANDLE                                                12060001
           END-EXEC                                                     12070001
           EXEC CICS                                                    12080001
                IGNORE CONDITION MAPFAIL                                12090001
           END-EXEC                                                     12100001
           .                                                            12110001
      *                                                                 12120001
      *                                                                 12130001
      *****************************************                         12140001
      * MAP MENU SIRVE PARA ESCOGER OPCIONES  *                         12150001
      * DEL MENU                              *                         12160001
      *****************************************                         12170001
       0222-SEND-MAPMENU06.                                             12180001
           EXEC CICS                                                    12190001
                SEND MAP('MSNOP06') MAPSET('MSNOP06')                   12200001
                     ERASE                                              12210001
                     FROM(MSNOP06O)                                     12220001
                     NOHANDLE                                           12230001
           END-EXEC                                                     12240001
           .                                                            12250001
       0223-RECIBE-MAPMENU06.                                           12260001
           EXEC CICS RECEIVE MAP('MSNOP06')                             12270001
                INTO(MSNOP06I)                                          12280001
                NOHANDLE                                                12290001
           END-EXEC                                                     12300001
           EXEC CICS                                                    12310001
                IGNORE CONDITION MAPFAIL                                12320001
           END-EXEC                                                     12330001
           .                                                            12340001
      *                                                                 12350001
      *                                                                 12360001
      *****************************************                         12370001
      * MAP MENU SIRVE PARA ESCOGER OPCIONES  *                         12380001
      * DEL MENU                              *                         12390001
      *****************************************                         12400001
       0222-SEND-MAPMENU07.                                             12410001
           EXEC CICS                                                    12420001
                SEND MAP('MSNOP07') MAPSET('MSNOP07')                   12430001
                     ERASE                                              12440001
                     FROM(MSNOP07O)                                     12450001
                     NOHANDLE                                           12460001
           END-EXEC                                                     12470001
           .                                                            12480001
       0223-RECIBE-MAPMENU07.                                           12490001
           EXEC CICS RECEIVE MAP('MSNOP07')                             12500001
                INTO(MSNOP07I)                                          12510001
                NOHANDLE                                                12520001
           END-EXEC                                                     12530001
           EXEC CICS                                                    12540001
                IGNORE CONDITION MAPFAIL                                12550001
           END-EXEC                                                     12560001
           .                                                            12570001
      *                                                                 12580001
      *                                                                 12590001
      *****************************************                         12600001
      * MAP MENU SIRVE PARA ESCOGER OPCIONES  *                         12610001
      * DEL MENU                              *                         12620001
      *****************************************                         12630001
       0222-SEND-MAPMENU08.                                             12640001
           EXEC CICS                                                    12650001
                SEND MAP('MSNOP08') MAPSET('MSNOP08')                   12660001
                     ERASE                                              12670001
                     FROM(MSNOP08O)                                     12680001
                     NOHANDLE                                           12690001
           END-EXEC                                                     12700001
           .                                                            12710001
       0223-RECIBE-MAPMENU08.                                           12720001
           EXEC CICS RECEIVE MAP('MSNOP08')                             12730001
                INTO(MSNOP08I)                                          12740001
                NOHANDLE                                                12750001
           END-EXEC                                                     12760001
           EXEC CICS                                                    12770001
                IGNORE CONDITION MAPFAIL                                12780001
           END-EXEC                                                     12790001
           .                                                            12800001
      *                                                                 12810001
      *****************************************                         12820001
      * EN ESTE MAPA ESTA LA INFORMACION DEL  *                         12830001
      * ESTUDIANTE                            *                         12840001
      *****************************************                         12850001
       0224-SEND-MAP.                                                   12860001
           MOVE USU                TO LOG5O                             12870001
           MOVE NOMUSU  TO LNOM5O                                       12880001
           MOVE APEUSU  TO LAPE5O                                       12890001
           EXEC CICS                                                    12900001
                SEND MAP('MSNES05') MAPSET('MSNES05')                   12910001
                     ERASE                                              12920001
                     FROM(MSNES05O)                                     12930001
                     NOHANDLE                                           12940001
           END-EXEC                                                     12950001
           .                                                            12960001
      **********************************************                    12970001
      * ENVIA EL MAPA                              *                    12980001
      **********************************************                    12990001
       0224-SEND-MAP1.                                                  13000001
           MOVE USU     TO LOG5O                                        13010001
           MOVE NOMUSU  TO LNOM5O                                       13020001
           MOVE APEUSU  TO LAPE5O                                       13030001
           MOVE CED     TO CEDO CEDI                                    13040001
           MOVE NOM     TO NOMO NOMI                                    13050001
           MOVE APE     TO APEO APEI                                    13060001
           MOVE DIR     TO DIRO DIRI                                    13070001
           EXEC CICS                                                    13080001
                SEND MAP('MSNES05') MAPSET('MSNES05')                   13090001
                     ERASE                                              13100001
                     FROM(MSNES05O)                                     13110001
                     NOHANDLE                                           13120001
           END-EXEC.                                                    13130001
       0225-RECIBE-MAP.                                                 13140001
      ********************************************                      13150001
      * RECIBIMOS EL MAP CON LOS DATOS DEL CRUD Y *                     13160001
      * LO LLEVAMOS AL COMMAREA PARA QUE NO SE NOS*                     13170001
      * SI SE DEBE RETORNAR LA TRANSACCION        *                     13180001
      *********************************************                     13190001
           EXEC CICS RECEIVE MAP('MSNES05')                             13200001
                INTO(MSNES05I)                                          13210001
                NOHANDLE                                                13220001
           END-EXEC                                                     13230001
           EXEC CICS                                                    13240001
                IGNORE CONDITION MAPFAIL                                13250001
           END-EXEC                                                     13260001
           .                                                            13270001
      *                                                                 13280001
      *****************************************                         13290001
      * FIN DE TODO LO RELACIONADOS CON LOS   *                         13300001
      * MAPAS                                 *                         13310001
      *****************************************                         13320001
      *                                                                 13330001
      ********************************************                      13340001
      * EN ESTA SECCION VERIFICAMOS SI ESCOGIO    *                     13350001
      * LA TECLA PF3 PARA RETORNAR A LA OPERACION *                     13360001
      * ANTERIOR                                  *                     13370001
      *********************************************                     13380001
      *                                                                 13390001
      ********************************************                      13400001
      * SE SALE DEL TODO DEL SISTEMA              *                     13410001
      *********************************************                     13420001
       0230-VALIDE-PF3.                                                 13430001
              IF EIBAID EQUAL DFHPF3   THEN                             13440001
                PERFORM 0300-FIN                                        13450001
              ELSE                                                      13460001
                MOVE 'TECLA INCORRECTA ¡¡¡¡¡¡¡' TO MSGO                 13470001
                PERFORM 0240-ENVIAR-MSG                                 13480001
              END-IF                                                    13490001
              .                                                         13500001
       0232-VALIDE-MENUPF3.                                             13510001
           IF EIBAID EQUAL DFHPF3   THEN                                13520001
             EVALUATE TRUE                                              13530001
               WHEN WS-CONS = 'SI' AND WS-BORR = 'SI' AND               13540001
                  WS-INGR = 'SI' AND WS-MODI = 'SI'                     13550001
                  MOVE LOW-VALUE          TO MSNOP03O                   13560001
                  MOVE USU                TO LOG03O                     13570001
                  MOVE NOMUSU             TO LNOM03O                    13580001
                  MOVE APEUSU             TO LAPE03O                    13590001
                  PERFORM 0222-SEND-MAPMENU03                           13600001
                  MOVE '01' TO CICLO                                    13610001
                  PERFORM 8200-RETORNO-TRANS                            13620001
               WHEN WS-CONS = 'SI' AND WS-BORR = 'NO' AND               13630001
                  WS-INGR = 'NO' AND WS-MODI = 'SI'                     13640001
                  MOVE LOW-VALUE          TO MSNOP04O                   13650001
                  MOVE USU                TO LOG04O                     13660001
                  MOVE NOMUSU             TO LNOM04O                    13670001
                  MOVE APEUSU             TO LAPE04O                    13680001
                  PERFORM 0222-SEND-MAPMENU04                           13690001
                  MOVE '01' TO CICLO                                    13700001
                  PERFORM 8200-RETORNO-TRANS                            13710001
               WHEN WS-CONS = 'SI' AND WS-BORR = 'NO' AND               13720001
                  WS-INGR = 'NO' AND WS-MODI = 'NO'                     13730001
                 MOVE LOW-VALUE          TO MSNOP05O                    13740001
                 MOVE USU                TO LOG05O                      13750001
                 MOVE NOMUSU             TO LNOM05O                     13760001
                 MOVE APEUSU             TO LAPE05O                     13770001
                 PERFORM 0222-SEND-MAPMENU05                            13780001
                 MOVE '01' TO CICLO                                     13790001
                 PERFORM 8200-RETORNO-TRANS                             13800001
               WHEN WS-CONS = 'SI' AND WS-BORR = 'NO' AND               13810001
                  WS-INGR = 'SI' AND WS-MODI = 'NO'                     13820001
                 MOVE LOW-VALUE          TO MSNOP06O                    13830001
                 MOVE USU                TO LOG06O                      13840001
                 MOVE NOMUSU             TO LNOM06O                     13850001
                 MOVE APEUSU             TO LAPE06O                     13860001
                 PERFORM 0222-SEND-MAPMENU06                            13870001
                 MOVE '01' TO CICLO                                     13880001
                 PERFORM 8200-RETORNO-TRANS                             13890001
               WHEN WS-CONS = 'SI' AND WS-BORR = 'SI' AND               13900001
                  WS-INGR = 'NO' AND WS-MODI = 'NO'                     13910001
                 MOVE LOW-VALUE          TO MSNOP07O                    13920001
                 MOVE USU                TO LOG07O                      13930001
                 MOVE NOMUSU             TO LNOM07O                     13940001
                 MOVE APEUSU             TO LAPE07O                     13950001
                 PERFORM 0222-SEND-MAPMENU07                            13960001
                 MOVE '01' TO CICLO                                     13970001
                 PERFORM 8200-RETORNO-TRANS                             13980001
               WHEN WS-CONS = 'SI' AND WS-BORR = 'SI' AND               13990001
                  WS-INGR = 'SI' AND WS-MODI = 'NO'                     14000001
                 MOVE LOW-VALUE          TO MSNOP08O                    14010001
                 MOVE USU                TO LOG08O                      14020001
                 MOVE NOMUSU             TO LNOM08O                     14030001
                 MOVE APEUSU             TO LAPE08O                     14040001
                 PERFORM 0222-SEND-MAPMENU08                            14050001
                 MOVE '01' TO CICLO                                     14060001
                 PERFORM 8200-RETORNO-TRANS                             14070001
               WHEN OTHER                                               14080001
                MOVE "                 TECLA  NO PERMITIDA "            14090001
                                             TO MSGO                    14100001
                PERFORM 0224-SEND-MAP1                                  14110001
                PERFORM 8200-RETORNO-TRANS                              14120001
             END-EVALUATE                                               14130001
           ELSE                                                         14140001
             MOVE "             TECLA NO PERMITIDA      "               14150001
                                             TO MSGO                    14160001
             PERFORM 0224-SEND-MAP1                                     14170001
             PERFORM 8200-RETORNO-TRANS                                 14180001
           END-IF                                                       14190001
              .                                                         14200001
      *                                                                 14210001
       0232-VALIDE-SCROLLPF3.                                           14220001
      *    IF EIBAID EQUAL DFHPF3 OR EIBAID NOT EQUAL DFHENTER THEN     14230001
               MOVE 'CUALQUIER TECLA CONTINUE' TO TECO                  14240001
               MOVE '09' TO CICLO                                       14250001
               PERFORM MOVER-ETIQUETAS                                  14260001
               PERFORM MOVER-SELECT                                     14270001
               MOVE CEDI TO CED                                         14280001
               PERFORM PROTEJA-CEDI                                     14290001
               PERFORM 0224-SEND-MAP1                                   14300001
               PERFORM 8200-RETORNO-TRANS                               14310001
      *    END-IF                                                       14320001
           .                                                            14330001
      *                                                                 14340001
      *                                                                 14350001
      ***************************************************               14360001
      * EN ESTA SECCION SE ENCUENTRA TODOS LOS PERFORM  *               14370001
      * RELACIONADOS A LA PREPARACION DE LA INFORMACION *               14380001
      * PARA REALIZAR SELECT,UPDATE,INSERT O DELETE     *               14390001
      ***************************************************               14400001
      *                                                                 14410001
       0250-PROCESE-CONS.                                               14420001
           MOVE SPACES TO NOM APE DIR EXISTE                            14430001
           MOVE "SELECT" TO TIPO                                        14440001
           MOVE '01' TO SUB-TIPO                                        14450001
           PERFORM 9000-PROCESE-CRUD                                    14460001
           MOVE LOW-VALUES TO MSNES05I                                  14470001
           IF EXISTE = '0'  THEN                                        14480001
             MOVE 'CONSULTA DE ESTUDIANTES' TO TITO                     14490001
             MOVE 'REGISTRO LEIDO            ' TO MSGO                  14500001
             MOVE 'F3=END ENTER= LEER F7=ANTERIOR F8=PROXIMO' TO TECO   14510001
             PERFORM MOVER-ETIQUETAS                                    14520001
             PERFORM MOVER-SELECT                                       14530001
             PERFORM 0224-SEND-MAP1                                     14540001
             MOVE '02' TO CICLO                                         14550001
           ELSE                                                         14560001
             MOVE 'CONSULTA DE ESTUDIANTES' TO TITO                     14570001
             MOVE 'EL ESTUDIANTE NO EXISTE   ' TO MSGO                  14580001
             MOVE 'F3=END ENTER= LEER F7=ANTERIOR F8=PROXIMO' TO TECO   14590001
             PERFORM MOVER-NO-EXISTE                                    14600001
             PERFORM 0224-SEND-MAP1                                     14610001
             MOVE    '02' TO CICLO                                      14620001
           END-IF                                                       14630001
           PERFORM 8200-RETORNO-TRANS                                   14640001
           .                                                            14650001
       0251-PROCESE-PROXIMO.                                            14660001
           PERFORM VALIDE-CEDI                                          14670001
           MOVE ZEROS TO WS-CEDI-PROXIMO                                14680001
           MOVE 8 TO WS-OPERACION                                       14690001
           PERFORM 0264-LEA-ELPROXIMO                                   14700001
           IF WS-CEDI-PROXIMO NOT EQUAL ZEROS                           14710001
              PERFORM MOVER-ETIQUETAS                                   14720001
              MOVE 'ESTE ES EL PROXIMO  ' TO MSGO                       14730001
              PERFORM MOVER-REGISTROP                                   14740001
           ELSE                                                         14750001
              PERFORM MOVER-ETIQUETAS                                   14760001
              MOVE 'ULTIMO REGISTRO           ' TO MSGO                 14770001
              PERFORM MOVER-REGISTROP                                   14780001
           END-IF                                                       14790001
           MOVE 'CONSULTA DE ESTUDIANTES' TO TITO                       14800001
           MOVE 'F3=END ENTER= LEER F7=ANTERIOR F8=PROXIMO' TO TECO     14810001
           PERFORM 0224-SEND-MAP1                                       14820001
           PERFORM 8200-RETORNO-TRANS                                   14830001
              .                                                         14840001
       0252-PROCESE-ANTERIOR.                                           14850001
           PERFORM VALIDE-CEDI                                          14860001
           MOVE ZEROS TO WS-CEDI-PROXIMO                                14870001
           MOVE 7 TO WS-OPERACION                                       14880001
           PERFORM 0264-LEA-ELPROXIMO                                   14890001
           IF WS-CEDI-PROXIMO NOT EQUAL ZEROS                           14900001
              PERFORM MOVER-ETIQUETAS                                   14910001
              MOVE 'ESTE ES EL ANTERIOR ' TO MSGO                       14920001
              PERFORM MOVER-REGISTROP                                   14930001
           ELSE                                                         14940001
              MOVE '02' TO CICLO                                        14950001
              PERFORM MOVER-ETIQUETAS                                   14960001
              MOVE 'PRIMER REGISTRO           ' TO MSGO                 14970001
              PERFORM MOVER-REGISTROP                                   14980001
           END-IF                                                       14990001
           MOVE 'CONSULTA DE ESTUDIANTES' TO TITO                       15000001
           MOVE 'F3=END ENTER= LEER F7=ANTERIOR F8=PROXIMO' TO TECO     15010001
           PERFORM 0224-SEND-MAP1                                       15020001
           PERFORM 8200-RETORNO-TRANS                                   15030001
              .                                                         15040001
       0253-MOD-FILE.                                                   15050001
           PERFORM MOVER-UPDATE                                         15060001
           MOVE 'UPDATE' TO TIPO                                        15070001
           MOVE '01' TO SUB-TIPO                                        15080001
           PERFORM 9000-PROCESE-CRUD                                    15090001
           MOVE LOW-VALUES TO MSNES05I                                  15100001
           IF EXISTE = '0'  THEN                                        15110001
             MOVE 'MODIFICACION DE ESTUDIANTES' TO TITO                 15120001
             MOVE 'REGISTRO MODIFICADO       ' TO MSGO                  15130001
             MOVE 'F3=END ENTER= MOFIFICAR1' TO TECO                    15140001
           ELSE                                                         15150001
             MOVE 'MODIFICACION DE ESTUDIANTES' TO TITO                 15160001
             MOVE 'FATAL ERROR EN MODIFICACION' TO MSGO                 15170001
             MOVE 'F3=END ENTER= MOFIFICAR2' TO TECO                    15180001
           END-IF                                                       15190001
           PERFORM MOVER-REGISTRO-AMAP                                  15200001
           PERFORM MOVER-ETIQUETAS                                      15210001
           .                                                            15220001
       0254-INS-FILE.                                                   15230001
           PERFORM MOVER-INSERT                                         15240001
           MOVE 'INSERT' TO TIPO                                        15250001
           MOVE '01' TO SUB-TIPO                                        15260001
           PERFORM 9000-PROCESE-CRUD                                    15270001
           MOVE LOW-VALUES TO MSNES05I                                  15280001
           IF EXISTE = '0'  THEN                                        15290001
             MOVE 'ADICION DE ESTUDIANTES' TO TITO                      15300001
             MOVE 'REGISTRO ADICIONADO       ' TO MSGO                  15310001
             MOVE 'F3=END ENTER= ADICIONAR' TO TECO                     15320001
           ELSE                                                         15330001
             MOVE 'ADICION DE ESTUDIANTES' TO TITO                      15340001
             MOVE 'FATAL ERROR EN ADICIONAR   ' TO MSGO                 15350001
             MOVE 'F3=END ENTER= ADICIONAR' TO TECO                     15360001
           END-IF                                                       15370001
           PERFORM MOVER-REGISTRO-AMAP                                  15380001
           PERFORM MOVER-ETIQUETAS                                      15390001
           .                                                            15400001
       0255-RET-FILE.                                                   15410001
           MOVE CED TO CEDI                                             15420001
           PERFORM MOVER-UPDATE                                         15430001
           MOVE 'DELETE' TO TIPO                                        15440001
           MOVE '01' TO SUB-TIPO                                        15450001
           PERFORM 9000-PROCESE-CRUD                                    15460001
           MOVE LOW-VALUES TO MSNES05I                                  15470001
           IF EXISTE = '0'  THEN                                        15480001
             MOVE CED       TO LK-PM-DNI                                15490001
             PERFORM 0260-LEA-PERMISOS                                  15500001
             IF EXISTE = '0'                                            15510001
               MOVE 'RETIRO  DE ESTUDIANTES' TO TITO                    15520001
               MOVE 'ESTUDIANTE CON PERMISOS,RETIRE SUS PERMISOS'       15530001
                    TO MSGO                                             15540001
               MOVE 'F3=END ENTER= LEER     ' TO TECO                   15550001
             ELSE                                                       15560001
               MOVE 'RETIRO  DE ESTUDIANTES' TO TITO                    15570001
               MOVE 'REGISTRO RETIRADO         ' TO MSGO                15580001
               MOVE 'F3=END ENTER= LEER     ' TO TECO                   15590001
             END-IF                                                     15600001
           ELSE                                                         15610001
             MOVE 'RETIRO  DE ESTUDIANTES' TO TITO                      15620001
             MOVE 'FATAL ERROR EN RETIRO      ' TO MSGO                 15630001
             MOVE 'F3=END ENTER= LEER     ' TO TECO                     15640001
           END-IF                                                       15650001
           PERFORM MOVER-REGISTRO-AMAP                                  15660001
           PERFORM MOVER-ETIQUETAS                                      15670001
           .                                                            15680001
      *                                                                 15690001
      ****************************************************              15700001
      * EN ESTA SECCION VAMOS A PONER TODO LO RELACIONADO*              15710001
      * CON EL CICS SOBRE TODO MANEJO DE TABLAS          *              15720001
      ****************************************************              15730001
      *                                                                 15740001
       0264-LEA-ELPROXIMO.                                              15750001
           MOVE 1 TO WS-NUM-ELMENT                                      15760001
           EXEC CICS READQ  TS                                          15770001
                ITEM(WS-NUM-ELMENT)                                     15780001
                QUEUE (WS-COLA-USUARIOS)                                15790001
                INTO (COLA-USUARIOS)                                    15800001
                RESP (RESPUESTA)                                        15810001
           END-EXEC                                                     15820001
           IF RESPUESTA = DFHRESP(NORMAL)                               15830001
             MOVE 'N' TO WS-EOF                                         15840001
           ELSE                                                         15850001
             IF RESPUESTA = DFHRESP(NOTFND)                             15860001
               MOVE 'Y' TO WS-EOF                                       15870001
             END-IF                                                     15880001
           END-IF                                                       15890001
           PERFORM LEA-COLA UNTIL WS-EOF = 'Y'                          15900001
           .                                                            15910001
       0260-LEA-PERMISOS.                                               15920001
           MOVE 9         TO LK-PM-COD-RET                              15930001
           MOVE 1         TO LK-PM-TIPO-OPE                             15940001
           MOVE 1         TO LK-PM-SUBTIPO-OPE                          15950001
           MOVE WS-TRANSA TO LK-PM-TRAN                                 15960001
                                                                        15970001
           EXEC CICS LINK                                               15980001
                     PROGRAM('RSNPERMI')                                15990001
                     COMMAREA(AREA-LINK)                                16000001
                     LENGTH(LENGTH OF AREA-LINK)                        16010001
                     RESP(WS-RESPUESTA)                                 16020001
           END-EXEC                                                     16030001
           EVALUATE LK-PM-COD-RET                                       16040001
              WHEN 0                                                    16050001
                 MOVE 0 TO EXISTE                                       16060001
              WHEN OTHER                                                16070001
                 MOVE 1 TO EXISTE                                       16080001
           END-EVALUATE                                                 16090001
            .                                                           16100001
       0260-LEA-PERFILES.                                               16110001
           MOVE LOW-VALUES      TO AREA-LINK-RPF                        16120001
           MOVE 9               TO LK-PF-COD-RET                        16130001
           MOVE 1               TO LK-PF-TIPO-OPE                       16140001
           MOVE 1               TO LK-PF-SUBTIPO-OPE                    16150001
           MOVE LK-PM-IDPERFIL  TO LK-PF-IDPERFIL                       16160001
           MOVE WS-TRANSA       TO LK-PF-TRAN                           16170001
                                                                        16180001
           EXEC CICS LINK                                               16190001
                     PROGRAM('RSNPERFI')                                16200001
                     COMMAREA(AREA-LINK-RPF)                            16210001
                     LENGTH(LENGTH OF AREA-LINK-RPF)                    16220001
                     RESP(WS-RESPUESTA)                                 16230001
           END-EXEC                                                     16240001
           EVALUATE LK-PF-COD-RET                                       16250001
              WHEN 0                                                    16260001
                 MOVE 0 TO EXISTE                                       16270001
              WHEN OTHER                                                16280001
                 MOVE 1 TO EXISTE                                       16290001
           END-EVALUATE                                                 16300001
           .                                                            16310001
      ****************************************************              16320001
      * EN ESTA SECCION VAMOS A PONER TODO LO RELACIONADO*              16330001
      * CON LA VALIDACION DE CAMPOS                      *              16340001
      ****************************************************              16350001
      *                                                                 16360001
      *                                                                 16370001
       VALIDE-NOMI.                                                     16380001
           IF NOMI EQUAL LOW-VALUES OR NOMI = SPACES                    16390001
             IF APEI NOT = LOW-VALUES AND APEI NOT = SPACES             16400001
               MOVE APEI TO APE                                         16410001
             END-IF                                                     16420001
             IF DIRI NOT = LOW-VALUES AND DIRI NOT = SPACES             16430001
               MOVE DIRI TO DIR                                         16440001
             END-IF                                                     16450001
             MOVE 'INGRESA EL NOMBRE ¡¡¡¡¡¡¡' TO MSGO                   16460001
             PERFORM MOVER-ETIQUETAS                                    16470001
             PERFORM DESPROTEJA-CAMPOS                                  16480001
             MOVE CED  TO CEDI                                          16490001
             PERFORM 0224-SEND-MAP1                                     16500001
             PERFORM 0240-ENVIAR-MSG                                    16510001
             PERFORM 8200-RETORNO-TRANS                                 16520001
           ELSE                                                         16530001
             MOVE NOMI    TO NOM                                        16540001
           END-IF                                                       16550001
              .                                                         16560001
       VALIDE-APEI.                                                     16570001
           IF APEI EQUAL LOW-VALUES OR APEI = SPACES                    16580001
             IF DIRI NOT = LOW-VALUES AND DIRI NOT = SPACES             16590001
               MOVE DIRI TO DIR                                         16600001
             END-IF                                                     16610001
             MOVE 'INGRESA EL APELLIDO¡¡¡¡¡¡' TO MSGO                   16620001
             PERFORM MOVER-ETIQUETAS                                    16630001
             PERFORM DESPROTEJA-CAMPOS                                  16640001
             MOVE CED TO CEDI                                           16650001
             PERFORM 0224-SEND-MAP1                                     16660001
             PERFORM 0240-ENVIAR-MSG                                    16670001
             PERFORM 8200-RETORNO-TRANS                                 16680001
           ELSE                                                         16690001
             MOVE APEI TO APE                                           16700001
           END-IF                                                       16710001
              .                                                         16720001
       VALIDE-DIRI.                                                     16730001
           IF DIRI EQUAL LOW-VALUES OR DIRI = SPACES                    16740001
             MOVE 'INGRESA LA DIRECCION¡¡¡¡¡' TO MSGO                   16750001
             PERFORM MOVER-ETIQUETAS                                    16760001
             PERFORM DESPROTEJA-CAMPOS                                  16770001
             MOVE WC-CUR-DIR TO WC-CUR-POS                              16780001
             MOVE CED TO CEDI                                           16790001
             PERFORM 0224-SEND-MAP1                                     16800001
             PERFORM 0240-ENVIAR-MSG                                    16810001
             PERFORM 8200-RETORNO-TRANS                                 16820001
           ELSE                                                         16830001
             MOVE DIRI  TO DIR                                          16840001
           END-IF                                                       16850001
              .                                                         16860001
       VALIDE-CEDI.                                                     16870001
           IF CEDI EQUAL LOW-VALUES OR '_________' OR SPACES            16880001
              MOVE 'INGRESA UNA CEDULA¡¡¡¡¡¡¡' TO MSGO                  16890001
              EVALUATE TRUE                                             16900001
               WHEN CICLO-7                                             16910001
                MOVE 'RETIRO  DE ESTUDIANTES' TO TITO                   16920001
              END-EVALUATE                                              16930001
              PERFORM 0224-SEND-MAP1                                    16940001
              PERFORM 0240-ENVIAR-MSG                                   16950001
              PERFORM 8200-RETORNO-TRANS                                16960001
           END-IF                                                       16970001
              .                                                         16980001
      **********************************************************        16990001
      * MOVER DATOS                                            *        17000001
      **********************************************************        17010001
       MOVER-ETIQUETAS.                                                 17020001
           MOVE USU                           TO LOG5O                  17030001
           MOVE '              NOMBRE       ' TO TNOMO                  17040001
           MOVE '              APELLIDO     ' TO TAPEO                  17050001
           MOVE '              DIRECCION    ' TO TDIRO                  17060001
             .                                                          17070001
      ***************************************************               17080001
      * EL SELECT SE REALIZO CON EL ENCAPSULADOR Y ESTE *               17090001
      * NOS RETORNA LA INFORMACION EN EL COMMAREA Y AQUI*               17100001
      * LLEVAMOS LAS VARIABLES DEL COMMAREA AL MAPA     *               17110001
      ***************************************************               17120001
       MOVER-SELECT.                                                    17130001
           MOVE CED                   TO CEDO CEDI                      17140001
           MOVE NOM                   TO NOMO NOMI                      17150001
           MOVE APE                   TO APEO APEI                      17160001
           MOVE DIR                   TO DIRO DIRI                      17170001
           .                                                            17180001
       LEA-COLA.                                                        17190001
           IF C-DNI = CED                                               17200001
             PERFORM COMPARAR                                           17210001
           END-IF                                                       17220001
           IF WS-EOF NOT = 'Y'                                          17230001
              ADD  1 TO WS-NUM-ELMENT                                   17240001
              EXEC CICS READQ  TS                                       17250001
                ITEM(WS-NUM-ELMENT)                                     17260001
                QUEUE (WS-COLA-USUARIOS)                                17270001
                INTO (COLA-USUARIOS)                                    17280001
                RESP (RESPUESTA)                                        17290001
              END-EXEC                                                  17300001
              IF RESPUESTA = DFHRESP(NORMAL)                            17310001
                MOVE 'N' TO WS-EOF                                      17320001
              ELSE                                                      17330001
                IF RESPUESTA = DFHRESP(NOTFND)                          17340001
                  MOVE 'Y' TO WS-EOF                                    17350001
                ELSE                                                    17360001
                  MOVE 'Y' TO WS-EOF                                    17370001
                END-IF                                                  17380001
                IF WS-NUM-ELMENT = 0                                    17390001
                  MOVE 1 TO WS-NUM-ELMENT                               17400001
                ELSE                                                    17410001
                  COMPUTE WS-NUM-ELMENT = WS-NUM-ELMENT - 1             17420001
                END-IF                                                  17430001
                EXEC CICS READQ  TS                                     17440001
                  ITEM(WS-NUM-ELMENT)                                   17450001
                  QUEUE (WS-COLA-USUARIOS)                              17460001
                  INTO (COLA-USUARIOS)                                  17470001
                  RESP (RESPUESTA)                                      17480001
                END-EXEC                                                17490001
              END-IF                                                    17500001
           END-IF                                                       17510001
           .                                                            17520001
       COMPARAR.                                                        17530001
           IF WS-OPERACION = 8                                          17540001
             ADD  1 TO WS-NUM-ELMENT                                    17550001
           ELSE                                                         17560001
             IF WS-OPERACION = 7                                        17570001
               COMPUTE WS-NUM-ELMENT = WS-NUM-ELMENT - 1                17580001
               IF WS-NUM-ELMENT = 0                                     17590001
                 MOVE ZEROS TO WS-CEDI-PROXIMO                          17600001
                 MOVE 'Y' TO WS-EOF                                     17610001
               END-IF                                                   17620001
             END-IF                                                     17630001
           END-IF                                                       17640001
           EXEC CICS READQ  TS                                          17650001
               ITEM(WS-NUM-ELMENT)                                      17660001
               QUEUE (WS-COLA-USUARIOS)                                 17670001
               INTO (COLA-USUARIOS)                                     17680001
               RESP (RESPUESTA)                                         17690001
           END-EXEC                                                     17700001
           IF RESPUESTA = DFHRESP(NORMAL)                               17710001
             MOVE C-DNI TO WS-CEDI-PROXIMO                              17720001
             MOVE 'Y' TO WS-EOF                                         17730001
           ELSE                                                         17740001
             IF RESPUESTA = DFHRESP(NOTFND)                             17750001
               MOVE 'Y' TO WS-EOF                                       17760001
             ELSE                                                       17770001
               IF RESPUESTA = DFHRESP(ENDFILE)                          17780001
                 MOVE ZEROS TO WS-CEDI-PROXIMO                          17790001
                 MOVE 'Y' TO WS-EOF                                     17800001
               ELSE                                                     17810001
                 MOVE ZEROS TO WS-CEDI-PROXIMO                          17820001
                 MOVE 'Y' TO WS-EOF                                     17830001
               END-IF                                                   17840001
             END-IF                                                     17850001
           END-IF                                                       17860001
           .                                                            17870001
       MOVER-REGISTROP.                                                 17880001
           IF WS-CEDI-PROXIMO NOT EQUAL  ZEROS                          17890001
             MOVE C-DNI                  TO CED                         17900001
             MOVE C-NOMBRE               TO NOM                         17910001
             MOVE C-APELLIDOS            TO APE                         17920001
             MOVE C-DIRECCION            TO DIR                         17930001
      *    ELSE                                                         17940001
      *      PERFORM 0250-FALLO-FICHERO                                 17950001
           END-IF                                                       17960001
           .                                                            17970001
       MOVER-NO-EXISTE.                                                 17980001
            MOVE SPACES TO CED CEDO                                     17990001
            MOVE SPACES TO NOM NOMO                                     18000001
            MOVE SPACES TO APE APEO                                     18010001
            MOVE SPACES TO DIR DIRO                                     18020001
            .                                                           18030001
      **********************************************************        18040001
      * MOVE DATOS DEL MAPA AL COMMAREA                        *        18050001
      **********************************************************        18060001
       MOVER-UPDATE.                                                    18070001
            MOVE 'ESTUD'   TO TIPOUSUA                                  18080001
            MOVE CEDI      TO CED                                       18090001
            MOVE NOMI      TO NOM                                       18100001
            MOVE APEI      TO APE                                       18110001
            MOVE DIRI      TO DIR                                       18120001
            MOVE APEI(1:3) TO CLAVE(1:3)                                18130001
            MOVE NOMI(1:3) TO CLAVE(4:3)                                18140001
            MOVE '  '      TO CLAVE(7:2)                                18150001
            MOVE SPACES TO EXISTE                                       18160001
            .                                                           18170001
       MOVER-INSERT.                                                    18180001
            MOVE 'ESTUD' TO TIPOUSUA                                    18190001
            MOVE APEI(1:3) TO CLAVE(1:3)                                18200001
            MOVE NOMI(1:3) TO CLAVE(4:3)                                18210001
            MOVE '  '      TO CLAVE(7:2)                                18220001
            MOVE 'ESTUDIANTE' TO CARGO                                  18230001
            MOVE 'A' TO ESTADO                                          18240001
            MOVE CEDI   TO CED                                          18250001
            MOVE NOMI   TO NOM                                          18260001
            MOVE APEI   TO APE                                          18270001
            MOVE DIRI   TO DIR                                          18280001
            MOVE SPACES TO EXISTE                                       18290001
            .                                                           18300001
       DESPROTEJA-CAMPOS.                                               18310001
           MOVE DFHBMPRO   TO CEDF                                      18320001
           MOVE DFHBMUNP   TO NOMF                                      18330001
           MOVE DFHBMUNP   TO APEF                                      18340001
           MOVE DFHBMUNP   TO DIRF                                      18350001
            .                                                           18360001
       PROTEJA-MAPA.                                                    18370001
           MOVE DFHBMPRO   TO CEDF                                      18380001
           MOVE DFHBMPRO   TO NOMF                                      18390001
           MOVE DFHBMPRO   TO APEF                                      18400001
           MOVE DFHBMPRO   TO DIRF                                      18410001
            .                                                           18420001
       PROTEJA-CEDI.                                                    18430001
           MOVE DFHBMPRO   TO CEDF                                      18440001
            .                                                           18450001
       MOVER-REGISTRO-AMAP.                                             18460001
            MOVE CED                  TO CEDI CEDO                      18470001
            MOVE NOM                  TO NOMI NOMO                      18480001
            MOVE APE                  TO APEI APEO                      18490001
            MOVE DIR                  TO DIRI DIRO                      18500001
           .                                                            18510001
       0240-ENVIAR-MSG.                                                 18520001
           PERFORM 8200-RETORNO-TRANS                                   18530001
           .                                                            18540001
       0250-FALLO-FICHERO.                                              18550001
             MOVE 1 TO WS-EXISTE                                        18560001
             MOVE 'EL ESTUDIANTE NO EXISTE'                             18570001
                  TO MSGO                                               18580001
             MOVE SPACES                 TO NOMO                        18590001
                                             APEO                       18600001
                                             DIRO                       18610001
           .                                                            18620001
      *****************************************                         18630001
      * DEVUELVE EL CONTROL A LA TRANSACCION  *                         18640001
      *****************************************                         18650001
       8200-RETORNO-TRANS.                                              18660001
           MOVE EIBTRMID   TO TERM                                      18670001
           MOVE 'SN05'     TO TRANS                                     18680001
           EXEC CICS RETURN                                             18690001
                TRANSID('SN05')                                         18700001
                COMMAREA(MI-COMMAREA)                                   18710001
                LENGTH(LENGTH OF MI-COMMAREA)                           18720001
           END-EXEC                                                     18730001
           GOBACK                                                       18740001
           .                                                            18750001
       9000-PROCESE-CRUD.                                               18760001
      ************************************************************      18770001
      * LLAMAMOS AL PROGRAMA QUE REALIZA LAS OPERACIONES DEL CRUD*      18780001
      ************************************************************      18790001
           MOVE MI-COMMAREA TO RC-COMMAREA                              18800001
           MOVE LOW-VALUES  TO MI-COMMAREA                              18810001
           MOVE 'LINK'      TO TRANS                                    18820001
           EXEC CICS LINK                                               18830001
                PROGRAM('RENUSUA2')                                     18840001
                COMMAREA(RC-COMMAREA)                                   18850001
                LENGTH(LENGTH OF MI-COMMAREA)                           18860001
                RESP(RESPUESTA)                                         18870001
           END-EXEC                                                     18880001
           IF RESPUESTA = DFHRESP(NORMAL) THEN                          18890001
             MOVE RC-COMMAREA TO    MI-COMMAREA                         18900001
           END-IF                                                       18910001
           .                                                            18920001
