000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. PSNETS73.
000300 AUTHOR. LUIS F VELASQUEZ T.
000400 DATE-WRITTEN. 21/09/2024.
000500 DATE-COMPILED.
000595****************************************************
000600* SIMULA ENCAPSULADOR DE NOTAS                     *
000620*                                                  *
000630*                                                  *
000640* ES LLAMADO MEDIANTE EL COMANDO LINK DE CICS      *
000650* RECIBE EL DNI DEL ESTUDIANTE A CONSULTAR         *
000660* SI LA PETICION ES 1/4 ENTONCES                   *
000660*    DEVUELVE INDICADOR DE HALLADO O NO*
000670*    DEVUELVE EL NUMERO DE NOTAS DEL ESTUDIANTE    *
000680* DE LO CONTRARIO                                  *
000690*    SI LA PETICION ES 1/1 ENTONCES                *
000695*       DEVUELE LA NOTA DEL CURSO CUYO             *
000695*         ORDINAL HAYA SIDO SUMINISTRADO           *
000695*    DE LO CONTRARIO                               *
000695*       DEVUELVE LA INDICACION "PETICION ERRADA"   *
000695*    FIN-SI                                        *
000695* FIN-SI                                           *
000696****************************************************
000700 ENVIRONMENT DIVISION.
000800 CONFIGURATION SECTION.
000900 SPECIAL-NAMES.
001000 INPUT-OUTPUT SECTION.
001100 DATA DIVISION.
001200 WORKING-STORAGE SECTION.
001300* COPY AREAS PARA FECHAS
001400* COPY UFECHAS.
001420 77  W-CNT-CURSOS PIC 99 VALUE 0.
001430 77  SW-HALLADO   PIC X VALUE "N".
001500 01  WS-NOMBRES-MESES.
001600     03 WS-NOM-MESES
001700          PIC X(36) VALUE
001800       "ENEFEBMARABRMAYJUNJULAGOSEPOCTNOVDIC".
001900     03 WS-NOM-MES REDEFINES WS-NOM-MESES
002000          PIC XXX OCCURS 12 TIMES INDEXED BY IX-MES.
002100 01  WS-CURRENT-DATE-FIELDS.
002200     05 WS-CURRENT-DATE.
002300       10 WS-CURRENT-YEAR     PIC 9999.
002400       10 WS-CURRENT-MONTH    PIC 99.
002500       10 WS-CURRENT-DAY      PIC 99.
002600     05 WS-CURRENT-TIME.
002700       10 WS-CURRENT-HH       PIC 99.
002800       10 WS-CURRENT-MM       PIC 99.
002900       10 WS-CURRENT-SS       PIC 99.
003000       10 WS-CURRENT-CC       PIC 99.
003100 01  WS-FECHA-AAAA-MM-DD.
003200       10 WS-AAAA             PIC 9999.
003300       10 FILLER              PIC X VALUE "-".
003400       10 WS-MM               PIC 99.
003500       10 FILLER              PIC X VALUE "-".
003600       10 WS-DD               PIC 99.
003700 01  WS-HORA-MINUTOS-SEGUNDOS.
003800       10 WS-HH-F1            PIC 99.
003900       10 FILLER              PIC X VALUE ".".
004000       10 WS-MM-F1            PIC 99.
004100       10 FILLER              PIC X VALUE ":".
004200       10 WS-SS-F1            PIC 99.
004300       10 FILLER              PIC X VALUE ":".
004400       10 WS-CC-F1            PIC 99.
004500 01  WS-FECHA-DD-MMM-AA.
004600       10 WS-DD-F2            PIC 99.
004700       10 FILLER              PIC X VALUE "-".
004800       10 WS-MM-F2            PIC XXX.
004900       10 FILLER              PIC X VALUE "-".
005000       10 WS-AAAA-F2          PIC 9999.
005100
009300 01 DATOS-PRUEBA.
013800* COPY WSDEBDIS.
013810       05 WS-ESTUD.
013820          07 FILLER PIC X(13) VALUE "9533075  0104".
013910          07 FILLER PIC X(13) VALUE "52056163 0507".
013940          07 FILLER PIC X(13) VALUE "52057782 0808".
013950          07 FILLER PIC X(13) VALUE "52263924 1417".
013900          07 FILLER PIC X(13) VALUE "52438489 0913".
014010          07 FILLER PIC X(13) VALUE "52825799 1919".
014020       05 TAB-ESTUD REDEFINES WS-ESTUD.
014030          07 ITM-ESTUD OCCURS 6 TIMES INDEXED BY IX-ESTUD.
                   09 ITM-DNI  PIC X(9).
014040             09 ITM-FROM PIC 99.
014060             09 ITM-TO   PIC 99.
013810       05 TAB-NOTAS.
013820          07 FILLER PIC X(11) VALUE "OS390202325".
013830          07 FILLER PIC X(11) VALUE "GITHB202432".
013840          07 FILLER PIC X(11) VALUE "OSZSE202341".
013850          07 FILLER PIC X(11) VALUE "CODB2202446".
013910          07 FILLER PIC X(11) VALUE "OSZSE202346".
013920          07 FILLER PIC X(11) VALUE "OS390202331".
013930          07 FILLER PIC X(11) VALUE "GITHB202435".
013940          07 FILLER PIC X(11) VALUE "CODB2202432".
013860          07 FILLER PIC X(11) VALUE "CODB2202432".
013870          07 FILLER PIC X(11) VALUE "OSZSE202441".
013880          07 FILLER PIC X(11) VALUE "CCICS202447".
013890          07 FILLER PIC X(11) VALUE "OS390202441".
013900          07 FILLER PIC X(11) VALUE "GITHB202335".
013950          07 FILLER PIC X(11) VALUE "OSZSE202426".
013960          07 FILLER PIC X(11) VALUE "CCICS202447".
013970          07 FILLER PIC X(11) VALUE "OS390202335".
013980          07 FILLER PIC X(11) VALUE "CODB2202326".
013990          07 FILLER PIC X(11) VALUE "CODB2202431".
014000          07 FILLER PIC X(11) VALUE "CODB2202340".
014010          07 FILLER PIC X(11) VALUE "CODB2202350".
014020       05 TAB-NOTEST REDEFINES TAB-NOTAS.
014030          07 NOTAEST OCCURS 20 TIMES INDEXED BY IX-NOTA.
014040             09 ITM-CURSO  PIC XXXXX.
014060             09 ITM-AAAA   PIC XXXX.
014070             09 ITM-NOTA   PIC 9V9.
014072 01  WS-CONTADORES.
014073     05 W-IND-FROM         PIC 99.
014074     05 W-IND-TO           PIC 99.
014076     05 W-IND-THIS         PIC 99.
014080 01  WS-SW-DEBUG.
014090     05 W-SW-DEBUG    PIC X VALUE "S".
014100 01  WS-DEBDIS-MSG.
014200     05 W-TIME-DIS    PIC X(11).
014300     05 FILLER        PIC X VALUE SPACES.
014400     05 W-PARRAFO     PIC X(10) VALUE SPACES.
014500     05 FILLER        PIC X VALUE SPACES.
014600     05 W-CAMPO       PIC X(10) VALUE SPACES.
014700     05 FILLER        PIC X VALUE "=".
014800     05 W-VALOR       PIC X(20).
014900     05 FILLER        PIC X VALUE SPACES.
015000     05 W-CAMPO1      PIC X(10) VALUE SPACES.
015100     05 FILLER        PIC X VALUE "=".
015200     05 W-VALOR1      PIC X(20).
015300     05 FILLER        PIC X VALUE SPACES.
015400     05 W-FECHA-DIS   PIC X(10).
015500
015600* AYUDAS DE BMS
015700 COPY DFHAID.
015800 COPY DFHBMSCA.
017000 LINKAGE SECTION.
017005 01 DFHCOMMAREA PIC X(132).
017100 01  AREA-LINK REDEFINES DFHCOMMAREA.
017110      05 LK-NT-TIPO-OPE      PIC 9(01).
017120      05 LK-NT-SUBTIPO       PIC 9(02).
017130      05 LK-NT-CURSO         PIC X(05).
017140      05 LK-NT-DNIESTUD      PIC X(09).
017150      05 LK-NT-AAAA          PIC X(04).
017160      05 LK-NT-NOTA          PIC 99V99.
017170      05 LK-NT-CONTADOR      PIC 9(2).
017170      05 LK-NT-INDICE        PIC 9(2).
017180      05 LK-NT-SQLCODE       PIC S9(9).
017190      05 LK-NT-COD-RET       PIC 9(02).
017270      05 FILLER              PIC X(92).
017300 PROCEDURE DIVISION USING DFHCOMMAREA.
017400 0000-MAIN.
017500     PERFORM 1000-INICIO-DE-PROGRAMA
017600     PERFORM 2000-PROCESO-PETICION
017700     PERFORM 9999-FIN-DE-PROGRAMA
017800     .
017900 1000-INICIO-DE-PROGRAMA.
018600     .
018700 2000-PROCESO-PETICION.
019300     IF LK-NT-TIPO-OPE = 1 AND LK-NT-SUBTIPO = 4 THEN
018000        DISPLAY "53--PIDE CNT/" LK-NT-TIPO-OPE "/"
018000                          LK-NT-SUBTIPO "/"
018050                          LK-NT-DNIESTUD "/CNT"
018050                          LK-NT-CONTADOR
019400        PERFORM 3200-CONSULTA-NUMERO-NOTAS
018000        DISPLAY "53--DEV CNT/" LK-NT-TIPO-OPE "/"
018000                          LK-NT-SUBTIPO "/"
018050                          LK-NT-DNIESTUD "/CNT"
018050                          LK-NT-CONTADOR
019450     ELSE
019460        IF LK-NT-TIPO-OPE = 1 AND LK-NT-SUBTIPO = 1 THEN
018000           DISPLAY "53--PIDE NOTA/" LK-NT-TIPO-OPE "/"
018000                                    LK-NT-SUBTIPO "/"
018050                                    LK-NT-DNIESTUD "/IX"
018050                                    LK-NT-INDICE
019470           PERFORM 3250-CONSULTAR-UNA-NOTA
018000           DISPLAY "53--DEV NOTA/"  LK-NT-TIPO-OPE "/"
018000                                    LK-NT-SUBTIPO "/"
018050                                    LK-NT-DNIESTUD "/IX"
018050                                    LK-NT-INDICE "/CUR"
018100                                    LK-NT-CURSO  "/NOTA"
018110                                    LK-NT-NOTA
019480        END-IF
019490     END-IF
019600     .
022200* COPY RUTINA FORMATO DE FECHAS
022300* COPY UGETDATE.
022400 3100-GET-DATES.
022500     MOVE FUNCTION CURRENT-DATE TO WS-CURRENT-DATE-FIELDS
022600     MOVE WS-CURRENT-YEAR       TO WS-AAAA
022700     MOVE WS-CURRENT-MONTH      TO WS-MM
022800     MOVE WS-CURRENT-DAY        TO WS-DD
022900     MOVE WS-CURRENT-YEAR       TO WS-AAAA-F2
023000     MOVE WS-CURRENT-DAY        TO WS-DD-F2
023100     SET IX-MES TO WS-CURRENT-MONTH
023200     MOVE WS-NOM-MES (IX-MES) TO WS-MM-F2
023300     MOVE WS-CURRENT-HH         TO WS-HH-F1
023400     MOVE WS-CURRENT-MM         TO WS-MM-F1
023500     MOVE WS-CURRENT-SS         TO WS-SS-F1
023600     MOVE WS-CURRENT-CC         TO WS-CC-F1
023700     .
023800
023900 3200-CONSULTA-NUMERO-NOTAS.
024500
024600     PERFORM 3100-GET-DATES
024900     MOVE 100 TO LK-NT-SQLCODE
025000     MOVE 0 TO LK-NT-CONTADOR
025000     SET IX-ESTUD TO 1
025100     SEARCH  ITM-ESTUD
025200         AT END MOVE 100 TO LK-NT-SQLCODE
025300     WHEN ITM-DNI (IX-ESTUD) = LK-NT-DNIESTUD
025400         COMPUTE LK-NT-CONTADOR = ITM-TO (IX-ESTUD) -
025500                 ITM-FROM (IX-ESTUD) + 1
025900     END-SEARCH
025910     IF LK-NT-CONTADOR > 0 THEN
025920         MOVE 0 TO LK-NT-SQLCODE
025940     END-IF
018000     DISPLAY "53--NN /" LK-NT-TIPO-OPE "/" LK-NT-SUBTIPO "/"
018100                        LK-NT-DNIESTUD "/IX" LK-NT-INDICE
018200                        "CNT/" LK-NT-CONTADOR
027200     .
027210 3250-CONSULTAR-UNA-NOTA.
024900     MOVE 100 TO LK-NT-SQLCODE
025000     SET IX-ESTUD TO 1
025050     MOVE 0 TO W-IND-FROM W-IND-TO
025100     SEARCH  ITM-ESTUD
025200         AT END MOVE 100 TO LK-NT-SQLCODE
025300     WHEN ITM-DNI (IX-ESTUD) = LK-NT-DNIESTUD
025310          MOVE ITM-TO (IX-ESTUD)   TO W-IND-TO
025320          MOVE ITM-FROM (IX-ESTUD) TO W-IND-FROM
025325     END-SEARCH
025330     COMPUTE W-IND-THIS = W-IND-FROM + LK-NT-INDICE - 1
025340     SET IX-NOTA TO W-IND-THIS
025400     MOVE 0 TO  LK-NT-SQLCODE LK-NT-COD-RET
025811     MOVE ITM-NOTA  (IX-NOTA) TO LK-NT-NOTA
025812     MOVE ITM-AAAA  (IX-NOTA) TO LK-NT-AAAA
025813     MOVE ITM-CURSO (IX-NOTA) TO LK-NT-CURSO
025950     .
040700* COPY PDEBDIS.
040800 9100-DEB-DIS.
040900      PERFORM 3100-GET-DATES
041000      MOVE WS-FECHA-AAAA-MM-DD TO W-FECHA-DIS
041100      MOVE WS-HORA-MINUTOS-SEGUNDOS TO W-TIME-DIS
041200      IF W-SW-DEBUG = "S" THEN
041300         DISPLAY WS-DEBDIS-MSG
041400      END-IF
041600      .
041800 9999-FIN-DE-PROGRAMA.
041900
042500     GOBACK
042600     .
