000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. PSNETS63.
000300 AUTHOR. LUIS F VELASQUEZ T.
000400 DATE-WRITTEN. 21/09/2024.
000500 DATE-COMPILED.
000595****************************************************
000600* SIMULA ENCAPSULADOR DE CURSOS                    *
000620*                                                  *
000630*                                                  *
000640* ES LLAMADO MEDIANTE EL COMANDO LINK DE CICS      *
000650* RECIBE EL CODIGO DEL CURSO   A CONSULTAR         *
000660* REGRESA EL INDICADOR DE SI LO ENCONTRO O NO      *
000670* Y SI LO ENCUENTRA DEVUELVE LA DESCRIPCION,       *
000680* Y EL INDICADOR DE QUE LO ENCONTRO.               *
000690*                                                  *
000695*                                                  *
000696****************************************************
000700 ENVIRONMENT DIVISION.
000800 CONFIGURATION SECTION.
000900 SPECIAL-NAMES.
001000 INPUT-OUTPUT SECTION.
001100 DATA DIVISION.
001200 WORKING-STORAGE SECTION.
001300* COPY AREAS PARA FECHAS
001400* COPY UFECHAS.
001500 01  WS-NOMBRES-MESES.
001600     03 WS-NOM-MESES
001700          PIC X(36) VALUE
001800       "ENEFEBMARABRMAYJUNJULAGOSEPOCTNOVDIC".
001900     03 WS-NOM-MES REDEFINES WS-NOM-MESES
002000          PIC XXX OCCURS 12 TIMES INDEXED BY IX-MES.
002100 01  WS-CURRENT-DATE-FIELDS.
002200     05 WS-CURRENT-DATE.
002300       10 WS-CURRENT-YEAR     PIC 9999.
002400       10 WS-CURRENT-MONTH    PIC 99.
002500       10 WS-CURRENT-DAY      PIC 99.
002600     05 WS-CURRENT-TIME.
002700       10 WS-CURRENT-HH       PIC 99.
002800       10 WS-CURRENT-MM       PIC 99.
002900       10 WS-CURRENT-SS       PIC 99.
003000       10 WS-CURRENT-CC       PIC 99.
003100 01  WS-FECHA-AAAA-MM-DD.
003200       10 WS-AAAA             PIC 9999.
003300       10 FILLER              PIC X VALUE "-".
003400       10 WS-MM               PIC 99.
003500       10 FILLER              PIC X VALUE "-".
003600       10 WS-DD               PIC 99.
003700 01  WS-HORA-MINUTOS-SEGUNDOS.
003800       10 WS-HH-F1            PIC 99.
003900       10 FILLER              PIC X VALUE ".".
004000       10 WS-MM-F1            PIC 99.
004100       10 FILLER              PIC X VALUE ":".
004200       10 WS-SS-F1            PIC 99.
004300       10 FILLER              PIC X VALUE ":".
004400       10 WS-CC-F1            PIC 99.
004500 01  WS-FECHA-DD-MMM-AA.
004600       10 WS-DD-F2            PIC 99.
004700       10 FILLER              PIC X VALUE "-".
004800       10 WS-MM-F2            PIC XXX.
004900       10 FILLER              PIC X VALUE "-".
005000       10 WS-AAAA-F2          PIC 9999.
005100
009300 01 DATOS-PRUEBA.
010500*       05 DNI-DNI OCCURS 6 TIMES INDEXED BY IX-DNI.
010600*          07 DNI-ESTUD  PIC X(9).
010700*          07 DNI-NOMEST PIC X(25).
010800*          07 DNI-APEEST PIC X(25).
010900*          07 DNI-FROM   PIC 9(4).
011000*          07 DNI-TO     PIC 9(4).
011100       05 NOMCURSOS.
011200          07 CUR-CURSO1    PIC X(30) VALUE "CCICSCOBOL CICS".
011300          07 CUR-CURSO2    PIC X(30) VALUE "CODB2COBOL DB2".
011400          07 CUR-CURSO3    PIC X(30) VALUE "OSZSEO/S Z SYSTEMS".
011500          07 CUR-CURSO4    PIC X(30) VALUE "OS390MVS S/O 390".
011600          07 CUR-CURSO5    PIC X(30) VALUE "GITHBGIT/GITHUB".
011650       05 NOM-CURSOS REDEFINES NOMCURSOS.
011700          07 CURSOS OCCURS 5 TIMES INDEXED BY IX-CUR.
011800             09 CUR-CODCUR PIC X(5).
011900             09 CUR-DESCUR PIC X(25).
013800* COPY WSDEBDIS.
013900 01  WS-SW-DEBUG.
014000     05 W-SW-DEBUG    PIC X VALUE "S".
014100 01  WS-DEBDIS-MSG.
014200     05 W-TIME-DIS    PIC X(11).
014300     05 FILLER        PIC X VALUE SPACES.
014400     05 W-PARRAFO     PIC X(10) VALUE SPACES.
014500     05 FILLER        PIC X VALUE SPACES.
014600     05 W-CAMPO       PIC X(10) VALUE SPACES.
014700     05 FILLER        PIC X VALUE "=".
014800     05 W-VALOR       PIC X(20).
014900     05 FILLER        PIC X VALUE SPACES.
015000     05 W-CAMPO1      PIC X(10) VALUE SPACES.
015100     05 FILLER        PIC X VALUE "=".
015200     05 W-VALOR1      PIC X(20).
015300     05 FILLER        PIC X VALUE SPACES.
015400     05 W-FECHA-DIS   PIC X(10).
015500
015600* AYUDAS DE BMS
015700 COPY DFHAID.
015800 COPY DFHBMSCA.
017000 LINKAGE SECTION.
017005 01 DFHCOMMAREA PIC X(132).
017100 01 AREA-LINK REDEFINES DFHCOMMAREA.
017110      05 LK-CU-TIPO-OPE      PIC 9(01).
017120      05 LK-CU-SUBTIPO-OPE   PIC 9(02).
017130      05 LK-CU-CURSO         PIC X(05).
017140      05 LK-CU-DESCRIPCION   PIC X(25).
017170      05 LK-CU-DNIPROFESOR   PIC X(9).
017180      05 LK-CU-ESTADO        PIC X.
017190      05 LK-CU-COD-RET       PIC 9(02).
017200      05 LK-CU-SQLCODE       PIC S9(9).
017270      05 FILLER              PIC X(78).
017300 PROCEDURE DIVISION USING DFHCOMMAREA.
017400 0000-MAIN.
017500     PERFORM 1000-INICIO-DE-PROGRAMA
017550     DISPLAY "--63 INI " DFHCOMMAREA
017600     PERFORM 2000-PROCESO-PETICION
017650     DISPLAY "--63 FIN" DFHCOMMAREA
017700     PERFORM 9999-FIN-DE-PROGRAMA
017800     .
017900 1000-INICIO-DE-PROGRAMA.
018000     MOVE "-> 63-1000-INICIO--" TO W-PARRAFO
018400     PERFORM 9100-DEB-DIS
018600     .
018700 2000-PROCESO-PETICION.
019300
019400     PERFORM 3200-CONSULTA-CURSO
019600     .
022200* COPY RUTINA FORMATO DE FECHAS
022300* COPY UGETDATE.
022400 3100-GET-DATES.
022500     MOVE FUNCTION CURRENT-DATE TO WS-CURRENT-DATE-FIELDS
022600     MOVE WS-CURRENT-YEAR       TO WS-AAAA
022700     MOVE WS-CURRENT-MONTH      TO WS-MM
022800     MOVE WS-CURRENT-DAY        TO WS-DD
022900     MOVE WS-CURRENT-YEAR       TO WS-AAAA-F2
023000     MOVE WS-CURRENT-DAY        TO WS-DD-F2
023100     SET IX-MES TO WS-CURRENT-MONTH
023200     MOVE WS-NOM-MES (IX-MES) TO WS-MM-F2
023300     MOVE WS-CURRENT-HH         TO WS-HH-F1
023400     MOVE WS-CURRENT-MM         TO WS-MM-F1
023500     MOVE WS-CURRENT-SS         TO WS-SS-F1
023600     MOVE WS-CURRENT-CC         TO WS-CC-F1
023700     .
023800
023900 3200-CONSULTA-CURSO.
024000     MOVE "--63-3200-BUSCA-CURSO--" TO W-PARRAFO
024300     MOVE "CURSO " TO W-CAMPO
024300     MOVE LK-CU-CURSO TO W-VALOR
024400     PERFORM 9100-DEB-DIS
024500
024600     PERFORM 3100-GET-DATES
024800     MOVE "**NO REGISTRADO **" TO LK-CU-DESCRIPCION
024900     MOVE 100 TO LK-CU-SQLCODE
025000     SET IX-CUR TO 1
025100     SEARCH  CURSOS
025200         AT END MOVE 100 TO LK-CU-SQLCODE
025300     WHEN CUR-CODCUR (IX-CUR) = LK-CU-CURSO
025400         MOVE 0 TO LK-CU-SQLCODE LK-CU-COD-RET
025500         MOVE CUR-DESCUR (IX-CUR) TO LK-CU-DESCRIPCION
025900     END-SEARCH
027200     .
040700* COPY PDEBDIS.
040800 9100-DEB-DIS.
040900      PERFORM 3100-GET-DATES
041000      MOVE WS-FECHA-AAAA-MM-DD TO W-FECHA-DIS
041100      MOVE WS-HORA-MINUTOS-SEGUNDOS TO W-TIME-DIS
041200      IF W-SW-DEBUG = "S" THEN
041300         DISPLAY WS-DEBDIS-MSG
041400      END-IF
041600      .
041800 9999-FIN-DE-PROGRAMA.
041900
042500     GOBACK
042600     .
