      *************************************************************     00010099
      *   ENCAPSULADOR TABLA PERFILES                                   00020099
      *   RUTINA QUE EJECUTA LAS SENTENCIAS DE LA BASE DE DATOS A       00022099
      *   PARTIR DE UN TIPO Y SUBTIPO DE OPERACION QUE ENVIA            00023099
      *   EL PROGRAMA QUE LA INVOCA.                                    00024099
      *   TIPO 1: CONSULTA - SELECT                                     00025099
      *      SUBTIPO 1: CONSULTA POR TRANSACCION Y IDPERFIL             00026099
      *        2: ADICION - INSERT                                      00027099
      *        3: BORRAR - DELETE                                       00028099
      *        4: MODIFICAR - UPDATE                                    00029099
      *************************************************************     00030099
       IDENTIFICATION DIVISION.                                         00040099
         PROGRAM-ID. RSNPERFI.                                          00050099
       ENVIRONMENT DIVISION.                                            00060099
       DATA DIVISION.                                                   00070099
       WORKING-STORAGE SECTION.                                         00080099
      *===============================================================  00090099
      * MODSQL - DEFINICION TABLA PERFILES SQL Y COBOL                  00100099
           EXEC SQL                                                     00110099
                INCLUDE PERFILES                                        00120099
           END-EXEC.                                                    00130099
      *===============================================================  00140099
      * MODSQL - SE TIENE QUE UTILIZAR SQLCA                            00150099
           EXEC SQL                                                     00160099
                INCLUDE SQLCA                                           00170099
           END-EXEC.                                                    00180099
      *===============================================================  00190099
      * MODSQL CAMPOS PARA ERROR DE DB2                                 00200099
       01  DB2-ERR.                                                     00210099
           03  DB2-SQLCODE                PIC S9(9).                    00220099
           03  DB2-SQLCODE-Z              PIC -ZZZZZZZZ9.               00230099
           03  DB2-ERROR.                                               00240099
               05  DB2-ERR-MSG            PIC X(50).                    00250099
               05  DB2-ERR-CODE           PIC X(20).                    00260099
                                                                        00270099
      *============================================================     00280099
       LINKAGE SECTION.                                                 00290099
       01  DFHCOMMAREA        PIC X(49).                                00300099
       01  AREA-LINK          REDEFINES DFHCOMMAREA.                    00310099
<<<<<<< HEAD
           05 LK-PF-COD-OPE      PIC 9(02).                             00330099
=======
           05 LK-PF-TIPO-OPE     PIC 9(01).                             00330099
           05 LK-PF-SUBTIPO-OPE  PIC 9(02).                             00331099
>>>>>>> main
           05 LK-PF-TRAN         PIC X(04).                             00340099
           05 LK-PF-IDPERFIL     PIC X(03).                             00350099
           05 LK-PF-NOMBRE       PIC X(20).                             00360099
           05 LK-PF-CONSUL       PIC X(02).                             00370099
           05 LK-PF-BORRAR       PIC X(02).                             00380099
           05 LK-PF-INGRESAR     PIC X(02).                             00390099
           05 LK-PF-MODIF        PIC X(02).                             00400099
           05 LK-PF-COD-RET      PIC 9(02).                             00401099
           05 LK-PF-SQLCODE      PIC S9(9).                             00410099
      *=================================================================00420099
       PROCEDURE DIVISION USING DFHCOMMAREA.                            00430099
      *=================================================================00440099
      ******************************************************************00450099
      * 0000-RAIZ                                                       00460099
      ******************************************************************00470099
       0000-RAIZ.                                                       00480099
      *    MODSQL EXCEPCIONES SQL DB2                                   00490099
           EXEC SQL                                                     00500099
                WHENEVER  SQLERROR    CONTINUE                          00510099
           END-EXEC                                                     00520099
                                                                        00530099
           EXEC SQL                                                     00540099
                WHENEVER  SQLWARNING  CONTINUE                          00550099
           END-EXEC                                                     00560099
                                                                        00570099
           EXEC SQL                                                     00580099
                WHENEVER  NOT FOUND   CONTINUE                          00590099
           END-EXEC                                                     00600099
                                                                        00610099
           PERFORM 0100-INICIO                                          00620099
           PERFORM 0200-EJECUTAR-OPERACION                              00630099
           PERFORM 0300-FIN                                             00640099
           .                                                            00650099
      ******************************************************************00660099
      * 0100-INICIO                                                     00670099
      ******************************************************************00680099
       0100-INICIO.                                                     00690099
           DISPLAY "ENTRO A RUTINA RTSNOTPF"                            00700099
           DISPLAY "AREA-LINK INP: " AREA-LINK                          00710099
           .                                                            00720099
      ******************************************************************00730099
      * 0200-EJECUTAR-OPERACION                                         00740099
      ******************************************************************00750099
       0200-EJECUTAR-OPERACION.                                         00760099
<<<<<<< HEAD
           DISPLAY "LK-PF-COD-OPE: " LK-PF-COD-OPE                      00770099
           EVALUATE LK-PF-COD-OPE                                       00780099
=======
           DISPLAY "LK-PF-COD-OPE: " LK-PF-TIPO-OPE                     00770099
           EVALUATE LK-PF-TIPO-OPE                                      00780099
>>>>>>> main
              WHEN 1                                                    00790099
      *          DISPLAY "CONSULTA"                                     00800099
                 PERFORM 0210-CONSULTAR-PERFIL                          00810099
              WHEN 2                                                    00820099
      *          DISPLAY "ADICION"                                      00830099
                 PERFORM 0220-INSERTAR-PERFIL                           00840099
              WHEN 3                                                    00850099
      *          DISPLAY "DELETE"                                       00860099
                 PERFORM 0230-BORRAR-PERFIL                             00870099
              WHEN 4                                                    00880099
      *          DISPLAY "UPDATE"                                       00890099
                 PERFORM 0240-MODIFICAR-PERFIL                          00900099
              WHEN OTHER                                                00910099
                 DISPLAY "OPCION NO IMPLEMENTADA"                       00920099
                 MOVE 9                        TO LK-PF-COD-RET         00930099
           END-EVALUATE                                                 00940099
           .                                                            00950099
      **************************************************************    00960099
      * 0210-CONSULTAR-PERFIL                                           00970099
      **************************************************************    00980099
       0210-CONSULTAR-PERFIL.                                           00990099
           MOVE 1              TO LK-PF-COD-RET                         01000099
           MOVE LK-PF-TRAN     TO PF-TRAN                               01010099
           MOVE LK-PF-IDPERFIL TO PF-IDPERFIL                           01020099
      *                                                                 01030099
           EXEC SQL                                                     01040099
             SELECT                                                     01050099
                NOMBRE, CONSUL, BORRAR, INGRESAR, MODIF                 01060099
             INTO                                                       01070099
                :PF-NOMBRE, :PF-CONSUL, :PF-BORRAR,                     01080099
                :PF-INGRESAR, :PF-MODIF                                 01090099
             FROM PERFILES                                              01100099
             WHERE TRAN = :PF-TRAN  AND  IDPERFIL = :PF-IDPERFIL        01110099
           END-EXEC                                                     01120099
                                                                        01130099
           IF SQLCODE = 0 THEN                                          01140099
              MOVE 0             TO  LK-PF-COD-RET                      01150099
              MOVE PF-NOMBRE     TO  LK-PF-NOMBRE                       01160099
              MOVE PF-CONSUL     TO  LK-PF-CONSUL                       01170099
              MOVE PF-BORRAR     TO  LK-PF-BORRAR                       01180099
              MOVE PF-INGRESAR   TO  LK-PF-INGRESAR                     01190099
              MOVE PF-MODIF      TO  LK-PF-MODIF                        01200099
           ELSE                                                         01210099
              IF SQLCODE = +100 THEN                                    01220099
                 MOVE 1 TO  LK-PF-COD-RET                               01230099
              ELSE                                                      01240099
                 MOVE 2 TO  LK-PF-COD-RET                               01250099
                 PERFORM 0900-ERROR-DB2                                 01260099
              END-IF                                                    01270099
           END-IF                                                       01280099
           .                                                            01290099
      ***************************************************               01300099
      * INSERTA LOS DATOS EN LA TABLA                   *               01310099
      ***************************************************               01320099
       0220-INSERTAR-PERFIL.                                            01330099
           MOVE LK-PF-TRAN       TO  PF-TRAN                            01340099
           MOVE LK-PF-IDPERFIL   TO  PF-IDPERFIL                        01350099
           MOVE LK-PF-NOMBRE     TO  PF-NOMBRE                          01360099
           MOVE LK-PF-CONSUL     TO  PF-CONSUL                          01370099
           MOVE LK-PF-BORRAR     TO  PF-BORRAR                          01380099
           MOVE LK-PF-INGRESAR   TO  PF-INGRESAR                        01390099
           MOVE LK-PF-MODIF      TO  PF-MODIF                           01400099
                                                                        01410099
           EXEC SQL                                                     01420099
             INSERT INTO PERFILES                                       01430099
                (                                                       01440099
                 TRAN, IDPERFIL, NOMBRE, CONSUL, BORRAR,                01450099
                 INGRESAR, MODIF                                        01460099
                )                                                       01470099
             VALUES                                                     01480099
                (                                                       01490099
                 :PF-TRAN, :PF-IDPERFIL, :PF-NOMBRE, :PF-CONSUL,        01500099
                 :PF-BORRAR, :PF-INGRESAR, :PF-MODIF                    01510099
                )                                                       01520099
           END-EXEC                                                     01530099
                                                                        01540099
           IF SQLCODE = 0                                               01550099
             MOVE 0         TO LK-PF-COD-RET                            01560099
           ELSE                                                         01570099
             IF SQLCODE = +100 THEN                                     01580099
                MOVE 1      TO  LK-PF-COD-RET                           01590099
             ELSE                                                       01600099
                MOVE 2      TO  LK-PF-COD-RET                           01610099
                PERFORM 0900-ERROR-DB2                                  01620099
             END-IF                                                     01630099
           END-IF                                                       01640099
           .                                                            01650099
      ***************************************************               01660099
      * BORRA UN REGISTRO CON EL NUMERO DE LA CLAVE     *               01670099
      ***************************************************               01680099
       0230-BORRAR-PERFIL.                                              01690099
           MOVE LK-PF-TRAN       TO  PF-TRAN                            01700099
           MOVE LK-PF-IDPERFIL   TO  PF-IDPERFIL                        01710099
                                                                        01720099
           EXEC SQL                                                     01730099
             DELETE FROM PERFILES                                       01740099
               WHERE TRAN = :PF-TRAN  AND  IDPERFIL = :PF-IDPERFIL      01750099
           END-EXEC                                                     01760099
                                                                        01770099
           IF SQLCODE = 0                                               01780099
             MOVE 0         TO LK-PF-COD-RET                            01790099
           ELSE                                                         01800099
             IF SQLCODE = +100 THEN                                     01810099
                MOVE 1      TO  LK-PF-COD-RET                           01820099
             ELSE                                                       01830099
                MOVE 2      TO  LK-PF-COD-RET                           01840099
                PERFORM 0900-ERROR-DB2                                  01850099
             END-IF                                                     01860099
           END-IF                                                       01870099
           .                                                            01880099
      ***************************************************               01890099
      * ACTUALIZA LOS DATOS EN LA TABLA                 *               01900099
      ***************************************************               01910099
       0240-MODIFICAR-PERFIL.                                           01920099
           MOVE LK-PF-TRAN       TO  PF-TRAN                            01930099
           MOVE LK-PF-IDPERFIL   TO  PF-IDPERFIL                        01940099
           MOVE LK-PF-NOMBRE     TO  PF-NOMBRE                          01950099
           MOVE LK-PF-CONSUL     TO  PF-CONSUL                          01960099
           MOVE LK-PF-BORRAR     TO  PF-BORRAR                          01970099
           MOVE LK-PF-INGRESAR   TO  PF-INGRESAR                        01980099
           MOVE LK-PF-MODIF      TO  PF-MODIF                           01990099
                                                                        02000099
           EXEC SQL                                                     02010099
              UPDATE PERFILES                                           02020099
              SET NOMBRE      = :PF-NOMBRE,                             02030099
                  CONSUL      = :PF-CONSUL,                             02040099
                  BORRAR      = :PF-BORRAR,                             02050099
                  INGRESAR    = :PF-INGRESAR,                           02060099
                  MODIF       = :PF-MODIF                               02070099
              WHERE TRAN = :PF-TRAN  AND  IDPERFIL = :PF-IDPERFIL       02080099
           END-EXEC                                                     02090099
                                                                        02100099
           IF SQLCODE = 0                                               02110099
             MOVE 0         TO LK-PF-COD-RET                            02120099
           ELSE                                                         02130099
             IF SQLCODE = +100 THEN                                     02140099
                MOVE 1      TO  LK-PF-COD-RET                           02150099
             ELSE                                                       02160099
                MOVE 2      TO  LK-PF-COD-RET                           02170099
                PERFORM 0900-ERROR-DB2                                  02180099
             END-IF                                                     02190099
           END-IF                                                       02200099
           .                                                            02210099
      ******************************************************************02220099
      * 0900-ERROR-DB2                                                  02230099
      ******************************************************************02240099
       0900-ERROR-DB2.                                                  02250099
           MOVE SQLCODE     TO LK-PF-SQLCODE                            02251099
           MOVE SQLCODE     TO DB2-SQLCODE                              02252099
           DISPLAY "ERROR DB2 EN RUTINA: "                              02260099
           DISPLAY "DB2-SQLCODE ----> "  DB2-SQLCODE                    02270099
           DISPLAY "DB2-SQLCODE-Z --> "  DB2-SQLCODE-Z                  02280099
           DISPLAY "DB2-ERR-MSG ----> "  DB2-ERR-MSG                    02290099
           DISPLAY "DB2-ERR-CODE ---> "  DB2-ERR-CODE                   02300099
           .                                                            02310099
      ******************************************************************02320099
      * FIN SESION                                                      02330099
      ******************************************************************02340099
       0300-FIN.                                                        02350099
           DISPLAY "AREA-LINK OUT: " AREA-LINK                          02360099
           DISPLAY "SALGO DE RUTINA RTSNOTPF"                           02370099
           GOBACK                                                       02380099
           .                                                            02390099
      ******************************************************************02400099
