DSN    SYSTEM     (DSN1)
BIND   PACKAGE    (PKNOTAS)  -
       MEMBER     (PSNNPR04) -
       ACTION     (REPLACE)  -
       ISOLATION  (CS)       -
       VALIDATE   (BIND)     -
       RELEASE    (COMMIT)   -
       OWNER      (P390)     -
       QUALIFIER  (P390)
END
